define("product/config/install", ["base", "tools"], function($, T){
    "use strict";
    //安装类产品配置
    return {
        1001: {
            priceNote: "（不满15平米的按照900元计算；超过15平米的，每平米加收60元安装费）", //价格说明
            serviceNote: "本产品仅限购买云印喷绘产品的客户下单，上门测量免费，具体费用需要与客服沟通之后才能确定。" //服务说明
        },
        1002: {
            priceNote: "", //价格说明
            serviceNote: "本产品仅限购买云印喷绘产品的客户下单，上门测量免费，具体出工人数根据实际工程量决定出工人数。" //服务说明
        },
        1003: {
            priceNote: "", //价格说明
            serviceNote: "本产品仅限购买云印的广告字产品的客户下单，上门测量免费，具体出工人数根据实际工程量决定出工人数。" //服务说明
        }
    };
});