/**
 * 地址选择器
 * @author Woo
 * @since 2015-11-26
 * @version 1.0.0
 * @description 创建按钮样式
 * -------------------------
 * @author Woo
 * @since 2015-11-25
 * @version 1.0.1
 * @description 修改按钮样式
 * -------------------------
 * @copyright ininin.com
 */
!(function(window, document, undefined) {
    "use strict";
    /**
     * 地址选择基类
     * @param {Object} [options]
     * @returns {*}
     * @constructor
     */
    function AddressSelector(options) {
        var _this = this;
        var _init = _this.init;
        /**
         * 初始化
         * @param {Object} options 配置项
         */
        _this.init = function(options){
            var _this = this;
            options = options||{};
            var DATA = {"regions":{"华东":["江苏省","浙江省","安徽省","福建省","江西省","山东省","上海市","台湾省"],"华南":["广东省","广西壮族自治区","海南省","香港特别行政区","澳门特别行政区"],"华中":["湖北省","湖南省","河南省"],"华北":["河北省","山西省","北京市","天津市","内蒙古自治区"],"西北":["宁夏回族自治区","新疆维吾尔自治区","青海省","陕西省","甘肃省"],"西南":["四川省","云南省","贵州省","重庆市","西藏自治区"],"东北":["辽宁省","吉林省","黑龙江省","内蒙古自治区"]},"provinces":{"北京市":{"北京市":{"东城区":0,"西城区":0,"崇文区":0,"宣武区":0,"朝阳区":0,"丰台区":0,"石景山区":0,"海淀区":0,"门头沟区":0,"房山区":0,"通州区":0,"顺义区":0,"昌平区":0,"大兴区":0,"怀柔区":0,"平谷区":0,"密云县":0,"延庆县":0,"其它区":0}},"天津市":{"天津市":{"和平区":0,"河东区":0,"河西区":0,"南开区":0,"河北区":0,"红桥区":0,"塘沽区":0,"汉沽区":0,"大港区":0,"东丽区":0,"西青区":0,"津南区":0,"北辰区":0,"武清区":0,"宝坻区":0,"滨海新区":0,"宁河县":0,"静海县":0,"蓟县":0,"其它区":0}},"河北省":{"石家庄市":{"长安区":0,"桥东区":0,"桥西区":0,"新华区":0,"井陉矿区":0,"裕华区":0,"井陉县":0,"正定县":0,"栾城县":0,"行唐县":0,"灵寿县":0,"高邑县":0,"深泽县":0,"赞皇县":0,"无极县":0,"平山县":0,"元氏县":0,"赵县":0,"辛集市":0,"藁城市":0,"晋州市":0,"新乐市":0,"鹿泉市":0,"其它区":0},"唐山市":{"路南区":0,"路北区":0,"古冶区":0,"开平区":0,"丰南区":0,"丰润区":0,"滦县":0,"滦南县":0,"乐亭县":0,"迁西县":0,"玉田县":0,"唐海县":0,"遵化市":0,"迁安市":0,"其它区":0},"秦皇岛市":{"海港区":0,"山海关区":0,"北戴河区":0,"青龙满族自治县":0,"昌黎县":0,"抚宁县":0,"卢龙县":0,"其它区":0,"经济技术开发区":0},"邯郸市":{"邯山区":0,"丛台区":0,"复兴区":0,"峰峰矿区":0,"邯郸县":0,"临漳县":0,"成安县":0,"大名县":0,"涉县":0,"磁县":0,"肥乡县":0,"永年县":0,"邱县":0,"鸡泽县":0,"广平县":0,"馆陶县":0,"魏县":0,"曲周县":0,"武安市":0,"其它区":0},"邢台市":{"桥东区":0,"桥西区":0,"邢台县":0,"临城县":0,"内丘县":0,"柏乡县":0,"隆尧县":0,"任县":0,"南和县":0,"宁晋县":0,"巨鹿县":0,"新河县":0,"广宗县":0,"平乡县":0,"威县":0,"清河县":0,"临西县":0,"南宫市":0,"沙河市":0,"其它区":0},"保定市":{"新市区":0,"北市区":0,"南市区":0,"满城县":0,"清苑县":0,"涞水县":0,"阜平县":0,"徐水县":0,"定兴县":0,"唐县":0,"高阳县":0,"容城县":0,"涞源县":0,"望都县":0,"安新县":0,"易县":0,"曲阳县":0,"蠡县":0,"顺平县":0,"博野县":0,"雄县":0,"涿州市":0,"定州市":0,"安国市":0,"高碑店市":0,"高开区":0,"其它区":0},"张家口市":{"桥东区":0,"桥西区":0,"宣化区":0,"下花园区":0,"宣化县":0,"张北县":0,"康保县":0,"沽源县":0,"尚义县":0,"蔚县":0,"阳原县":0,"怀安县":0,"万全县":0,"怀来县":0,"涿鹿县":0,"赤城县":0,"崇礼县":0,"其它区":0},"承德市":{"双桥区":0,"双滦区":0,"鹰手营子矿区":0,"承德县":0,"兴隆县":0,"平泉县":0,"滦平县":0,"隆化县":0,"丰宁满族自治县":0,"宽城满族自治县":0,"围场满族蒙古族自治县":0,"其它区":0},"沧州市":{"新华区":0,"运河区":0,"沧县":0,"青县":0,"东光县":0,"海兴县":0,"盐山县":0,"肃宁县":0,"南皮县":0,"吴桥县":0,"献县":0,"孟村回族自治县":0,"泊头市":0,"任丘市":0,"黄骅市":0,"河间市":0,"其它区":0},"廊坊市":{"安次区":0,"广阳区":0,"固安县":0,"永清县":0,"香河县":0,"大城县":0,"文安县":0,"大厂回族自治县":0,"开发区":0,"燕郊经济技术开发区":0,"霸州市":0,"三河市":0,"其它区":0},"衡水市":{"桃城区":0,"枣强县":0,"武邑县":0,"武强县":0,"饶阳县":0,"安平县":0,"故城县":0,"景县":0,"阜城县":0,"冀州市":0,"深州市":0,"其它区":0}},"山西省":{"太原市":{"小店区":0,"迎泽区":0,"杏花岭区":0,"尖草坪区":0,"万柏林区":0,"晋源区":0,"清徐县":0,"阳曲县":0,"娄烦县":0,"古交市":0,"其它区":0},"大同市":{"城区":0,"矿区":0,"南郊区":0,"新荣区":0,"阳高县":0,"天镇县":0,"广灵县":0,"灵丘县":0,"浑源县":0,"左云县":0,"大同县":0,"其它区":0},"阳泉市":{"城区":0,"矿区":0,"郊区":0,"平定县":0,"盂县":0,"其它区":0},"长治市":{"长治县":0,"襄垣县":0,"屯留县":0,"平顺县":0,"黎城县":0,"壶关县":0,"长子县":0,"武乡县":0,"沁县":0,"沁源县":0,"潞城市":0,"城区":0,"郊区":0,"高新区":0,"其它区":0},"晋城市":{"城区":0,"沁水县":0,"阳城县":0,"陵川县":0,"泽州县":0,"高平市":0,"其它区":0},"朔州市":{"朔城区":0,"平鲁区":0,"山阴县":0,"应县":0,"右玉县":0,"怀仁县":0,"其它区":0},"晋中市":{"榆次区":0,"榆社县":0,"左权县":0,"和顺县":0,"昔阳县":0,"寿阳县":0,"太谷县":0,"祁县":0,"平遥县":0,"灵石县":0,"介休市":0,"其它区":0},"运城市":{"盐湖区":0,"临猗县":0,"万荣县":0,"闻喜县":0,"稷山县":0,"新绛县":0,"绛县":0,"垣曲县":0,"夏县":0,"平陆县":0,"芮城县":0,"永济市":0,"河津市":0,"其它区":0},"忻州市":{"忻府区":0,"定襄县":0,"五台县":0,"代县":0,"繁峙县":0,"宁武县":0,"静乐县":0,"神池县":0,"五寨县":0,"岢岚县":0,"河曲县":0,"保德县":0,"偏关县":0,"原平市":0,"其它区":0},"临汾市":{"尧都区":0,"曲沃县":0,"翼城县":0,"襄汾县":0,"洪洞县":0,"古县":0,"安泽县":0,"浮山县":0,"吉县":0,"乡宁县":0,"大宁县":0,"隰县":0,"永和县":0,"蒲县":0,"汾西县":0,"侯马市":0,"霍州市":0,"其它区":0},"吕梁市":{"离石区":0,"文水县":0,"交城县":0,"兴县":0,"临县":0,"柳林县":0,"石楼县":0,"岚县":0,"方山县":0,"中阳县":0,"交口县":0,"孝义市":0,"汾阳市":0,"其它区":0}},"内蒙古自治区":{"呼和浩特市":{"新城区":0,"回民区":0,"玉泉区":0,"赛罕区":0,"土默特左旗":0,"托克托县":0,"和林格尔县":0,"清水河县":0,"武川县":0,"其它区":0},"包头市":{"东河区":0,"昆都仑区":0,"青山区":0,"石拐区":0,"白云矿区":0,"九原区":0,"土默特右旗":0,"固阳县":0,"达尔罕茂明安联合旗":0,"其它区":0},"乌海市":{"海勃湾区":0,"海南区":0,"乌达区":0,"其它区":0},"赤峰市":{"红山区":0,"元宝山区":0,"松山区":0,"阿鲁科尔沁旗":0,"巴林左旗":0,"巴林右旗":0,"林西县":0,"克什克腾旗":0,"翁牛特旗":0,"喀喇沁旗":0,"宁城县":0,"敖汉旗":0,"其它区":0},"通辽市":{"科尔沁区":0,"科尔沁左翼中旗":0,"科尔沁左翼后旗":0,"开鲁县":0,"库伦旗":0,"奈曼旗":0,"扎鲁特旗":0,"霍林郭勒市":0,"其它区":0},"鄂尔多斯市":{"东胜区":0,"达拉特旗":0,"准格尔旗":0,"鄂托克前旗":0,"鄂托克旗":0,"杭锦旗":0,"乌审旗":0,"伊金霍洛旗":0,"其它区":0},"呼伦贝尔市":{"海拉尔区":0,"阿荣旗":0,"莫力达瓦达斡尔族自治旗":0,"鄂伦春自治旗":0,"鄂温克族自治旗":0,"陈巴尔虎旗":0,"新巴尔虎左旗":0,"新巴尔虎右旗":0,"满洲里市":0,"牙克石市":0,"扎兰屯市":0,"额尔古纳市":0,"根河市":0,"其它区":0},"巴彦淖尔市":{"临河区":0,"五原县":0,"磴口县":0,"乌拉特前旗":0,"乌拉特中旗":0,"乌拉特后旗":0,"杭锦后旗":0,"其它区":0},"乌兰察布市":{"集宁区":0,"卓资县":0,"化德县":0,"商都县":0,"兴和县":0,"凉城县":0,"察哈尔右翼前旗":0,"察哈尔右翼中旗":0,"察哈尔右翼后旗":0,"四子王旗":0,"丰镇市":0,"其它区":0},"兴安盟":{"乌兰浩特市":0,"阿尔山市":0,"科尔沁右翼前旗":0,"科尔沁右翼中旗":0,"扎赉特旗":0,"突泉县":0,"其它区":0},"锡林郭勒盟":{"二连浩特市":0,"锡林浩特市":0,"阿巴嘎旗":0,"苏尼特左旗":0,"苏尼特右旗":0,"东乌珠穆沁旗":0,"西乌珠穆沁旗":0,"太仆寺旗":0,"镶黄旗":0,"正镶白旗":0,"正蓝旗":0,"多伦县":0,"其它区":0},"阿拉善盟":{"阿拉善左旗":0,"阿拉善右旗":0,"额济纳旗":0,"其它区":0}},"辽宁省":{"沈阳市":{"和平区":0,"沈河区":0,"大东区":0,"皇姑区":0,"铁西区":0,"苏家屯区":0,"东陵区":0,"新城子区":0,"于洪区":0,"辽中县":0,"康平县":0,"法库县":0,"新民市":0,"浑南新区":0,"张士开发区":0,"沈北新区":0,"其它区":0},"大连市":{"中山区":0,"西岗区":0,"沙河口区":0,"甘井子区":0,"旅顺口区":0,"金州区":0,"长海县":0,"开发区":0,"瓦房店市":0,"普兰店市":0,"庄河市":0,"岭前区":0,"其它区":0},"鞍山市":{"铁东区":0,"铁西区":0,"立山区":0,"千山区":0,"台安县":0,"岫岩满族自治县":0,"高新区":0,"海城市":0,"其它区":0},"抚顺市":{"新抚区":0,"东洲区":0,"望花区":0,"顺城区":0,"抚顺县":0,"新宾满族自治县":0,"清原满族自治县":0,"其它区":0},"本溪市":{"平山区":0,"溪湖区":0,"明山区":0,"南芬区":0,"本溪满族自治县":0,"桓仁满族自治县":0,"其它区":0},"丹东市":{"元宝区":0,"振兴区":0,"振安区":0,"宽甸满族自治县":0,"东港市":0,"凤城市":0,"其它区":0},"锦州市":{"古塔区":0,"凌河区":0,"太和区":0,"黑山县":0,"义县":0,"凌海市":0,"北镇市":0,"其它区":0},"营口市":{"站前区":0,"西市区":0,"鲅鱼圈区":0,"老边区":0,"盖州市":0,"大石桥市":0,"其它区":0},"阜新市":{"海州区":0,"新邱区":0,"太平区":0,"清河门区":0,"细河区":0,"阜新蒙古族自治县":0,"彰武县":0,"其它区":0},"辽阳市":{"白塔区":0,"文圣区":0,"宏伟区":0,"弓长岭区":0,"太子河区":0,"辽阳县":0,"灯塔市":0,"其它区":0},"盘锦市":{"双台子区":0,"兴隆台区":0,"大洼县":0,"盘山县":0,"其它区":0},"铁岭市":{"银州区":0,"清河区":0,"铁岭县":0,"西丰县":0,"昌图县":0,"调兵山市":0,"开原市":0,"其它区":0},"朝阳市":{"双塔区":0,"龙城区":0,"朝阳县":0,"建平县":0,"喀喇沁左翼蒙古族自治县":0,"北票市":0,"凌源市":0,"其它区":0},"葫芦岛市":{"连山区":0,"龙港区":0,"南票区":0,"绥中县":0,"建昌县":0,"兴城市":0,"其它区":0}},"吉林省":{"长春市":{"南关区":0,"宽城区":0,"朝阳区":0,"二道区":0,"绿园区":0,"双阳区":0,"农安县":0,"九台市":0,"榆树市":0,"德惠市":0,"高新技术产业开发区":0,"汽车产业开发区":0,"经济技术开发区":0,"净月旅游开发区":0,"其它区":0},"吉林市":{"昌邑区":0,"龙潭区":0,"船营区":0,"丰满区":0,"永吉县":0,"蛟河市":0,"桦甸市":0,"舒兰市":0,"磐石市":0,"其它区":0},"四平市":{"铁西区":0,"铁东区":0,"梨树县":0,"伊通满族自治县":0,"公主岭市":0,"双辽市":0,"其它区":0},"辽源市":{"龙山区":0,"西安区":0,"东丰县":0,"东辽县":0,"其它区":0},"通化市":{"东昌区":0,"二道江区":0,"通化县":0,"辉南县":0,"柳河县":0,"梅河口市":0,"集安市":0,"其它区":0},"白山市":{"八道江区":0,"抚松县":0,"靖宇县":0,"长白朝鲜族自治县":0,"江源市":0,"临江市":0,"其它区":0},"松原市":{"宁江区":0,"前郭尔罗斯蒙古族自治县":0,"长岭县":0,"乾安县":0,"扶余县":0,"其它区":0},"白城市":{"洮北区":0,"镇赉县":0,"通榆县":0,"洮南市":0,"大安市":0,"其它区":0},"延边朝鲜族自治州":{"延吉市":0,"图们市":0,"敦化市":0,"珲春市":0,"龙井市":0,"和龙市":0,"汪清县":0,"安图县":0,"其它区":0}},"黑龙江省":{"哈尔滨市":{"道里区":0,"南岗区":0,"道外区":0,"香坊区":0,"动力区":0,"平房区":0,"松北区":0,"呼兰区":0,"依兰县":0,"方正县":0,"宾县":0,"巴彦县":0,"木兰县":0,"通河县":0,"延寿县":0,"阿城市":0,"双城市":0,"尚志市":0,"五常市":0,"其它区":0},"齐齐哈尔市":{"龙沙区":0,"建华区":0,"铁锋区":0,"昂昂溪区":0,"富拉尔基区":0,"碾子山区":0,"梅里斯达斡尔族区":0,"龙江县":0,"依安县":0,"泰来县":0,"甘南县":0,"富裕县":0,"克山县":0,"克东县":0,"拜泉县":0,"讷河市":0,"其它区":0},"鸡西市":{"鸡冠区":0,"恒山区":0,"滴道区":0,"梨树区":0,"城子河区":0,"麻山区":0,"鸡东县":0,"虎林市":0,"密山市":0,"其它区":0},"鹤岗市":{"向阳区":0,"工农区":0,"南山区":0,"兴安区":0,"东山区":0,"兴山区":0,"萝北县":0,"绥滨县":0,"其它区":0},"双鸭山市":{"尖山区":0,"岭东区":0,"四方台区":0,"宝山区":0,"集贤县":0,"友谊县":0,"宝清县":0,"饶河县":0,"其它区":0},"大庆市":{"萨尔图区":0,"龙凤区":0,"让胡路区":0,"红岗区":0,"大同区":0,"肇州县":0,"肇源县":0,"林甸县":0,"杜尔伯特蒙古族自治县":0,"其它区":0},"伊春市":{"伊春区":0,"南岔区":0,"友好区":0,"西林区":0,"翠峦区":0,"新青区":0,"美溪区":0,"金山屯区":0,"五营区":0,"乌马河区":0,"汤旺河区":0,"带岭区":0,"乌伊岭区":0,"红星区":0,"上甘岭区":0,"嘉荫县":0,"铁力市":0,"其它区":0},"佳木斯市":{"永红区":0,"向阳区":0,"前进区":0,"东风区":0,"郊区":0,"桦南县":0,"桦川县":0,"汤原县":0,"抚远县":0,"同江市":0,"富锦市":0,"其它区":0},"七台河市":{"新兴区":0,"桃山区":0,"茄子河区":0,"勃利县":0,"其它区":0},"牡丹江市":{"东安区":0,"阳明区":0,"爱民区":0,"西安区":0,"东宁县":0,"林口县":0,"绥芬河市":0,"海林市":0,"宁安市":0,"穆棱市":0,"其它区":0},"黑河市":{"爱辉区":0,"嫩江县":0,"逊克县":0,"孙吴县":0,"北安市":0,"五大连池市":0,"其它区":0},"绥化市":{"北林区":0,"望奎县":0,"兰西县":0,"青冈县":0,"庆安县":0,"明水县":0,"绥棱县":0,"安达市":0,"肇东市":0,"海伦市":0,"其它区":0},"大兴安岭地区":{"呼玛县":0,"塔河县":0,"漠河县":0,"加格达奇区":0,"其它区":0}},"上海市":{"上海市":{"黄浦区":0,"卢湾区":0,"徐汇区":0,"长宁区":0,"静安区":0,"普陀区":0,"闸北区":0,"虹口区":0,"杨浦区":0,"闵行区":0,"宝山区":0,"嘉定区":0,"浦东新区":0,"金山区":0,"松江区":0,"青浦区":0,"南汇区":0,"奉贤区":0,"川沙区":0,"崇明县":0,"其它区":0}},"江苏省":{"南京市":{"玄武区":0,"白下区":0,"秦淮区":0,"建邺区":0,"鼓楼区":0,"下关区":0,"浦口区":0,"栖霞区":0,"雨花台区":0,"江宁区":0,"六合区":0,"溧水县":0,"高淳县":0,"其它区":0},"无锡市":{"崇安区":0,"南长区":0,"北塘区":0,"锡山区":0,"惠山区":0,"滨湖区":0,"江阴市":0,"宜兴市":0,"新区":0,"其它区":0},"徐州市":{"鼓楼区":0,"云龙区":0,"九里区":0,"贾汪区":0,"泉山区":0,"丰县":0,"沛县":0,"铜山县":0,"睢宁县":0,"新沂市":0,"邳州市":0,"其它区":0},"常州市":{"天宁区":0,"钟楼区":0,"戚墅堰区":0,"新北区":0,"武进区":0,"溧阳市":0,"金坛市":0,"其它区":0},"苏州市":{"沧浪区":0,"平江区":0,"金阊区":0,"虎丘区":0,"吴中区":0,"相城区":0,"常熟市":0,"张家港市":0,"昆山市":0,"吴江市":0,"太仓市":0,"新区":0,"园区":0,"其它区":0},"南通市":{"崇川区":0,"港闸区":0,"通州区":0,"海安县":0,"如东县":0,"启东市":0,"如皋市":0,"通州市":0,"海门市":0,"开发区":0,"其它区":0},"连云港市":{"连云区":0,"新浦区":0,"海州区":0,"赣榆县":0,"东海县":0,"灌云县":0,"灌南县":0,"其它区":0},"淮安市":{"清河区":0,"楚州区":0,"淮阴区":0,"清浦区":0,"涟水县":0,"洪泽县":0,"盱眙县":0,"金湖县":0,"其它区":0},"盐城市":{"亭湖区":0,"盐都区":0,"响水县":0,"滨海县":0,"阜宁县":0,"射阳县":0,"建湖县":0,"东台市":0,"大丰市":0,"其它区":0},"扬州市":{"广陵区":0,"邗江区":0,"维扬区":0,"宝应县":0,"仪征市":0,"高邮市":0,"江都市":0,"经济开发区":0,"其它区":0},"镇江市":{"京口区":0,"润州区":0,"丹徒区":0,"丹阳市":0,"扬中市":0,"句容市":0,"其它区":0},"泰州市":{"海陵区":0,"高港区":0,"兴化市":0,"靖江市":0,"泰兴市":0,"姜堰市":0,"其它区":0},"宿迁市":{"宿城区":0,"宿豫区":0,"沭阳县":0,"泗阳县":0,"泗洪县":0,"其它区":0}},"浙江省":{"杭州市":{"上城区":0,"下城区":0,"江干区":0,"拱墅区":0,"西湖区":0,"滨江区":0,"萧山区":0,"余杭区":0,"桐庐县":0,"淳安县":0,"建德市":0,"富阳市":0,"临安市":0,"其它区":0},"宁波市":{"海曙区":0,"江东区":0,"江北区":0,"北仑区":0,"镇海区":0,"鄞州区":0,"象山县":0,"宁海县":0,"余姚市":0,"慈溪市":0,"奉化市":0,"其它区":0},"温州市":{"鹿城区":0,"龙湾区":0,"瓯海区":0,"洞头县":0,"永嘉县":0,"平阳县":0,"苍南县":0,"文成县":0,"泰顺县":0,"瑞安市":0,"乐清市":0,"其它区":0},"嘉兴市":{"南湖区":0,"秀洲区":0,"嘉善县":0,"海盐县":0,"海宁市":0,"平湖市":0,"桐乡市":0,"其它区":0},"湖州市":{"吴兴区":0,"南浔区":0,"德清县":0,"长兴县":0,"安吉县":0,"其它区":0},"绍兴市":{"越城区":0,"绍兴县":0,"新昌县":0,"诸暨市":0,"上虞市":0,"嵊州市":0,"其它区":0},"金华市":{"婺城区":0,"金东区":0,"武义县":0,"浦江县":0,"磐安县":0,"兰溪市":0,"义乌市":0,"东阳市":0,"永康市":0,"其它区":0},"衢州市":{"柯城区":0,"衢江区":0,"常山县":0,"开化县":0,"龙游县":0,"江山市":0,"其它区":0},"舟山市":{"定海区":0,"普陀区":0,"岱山县":0,"嵊泗县":0,"其它区":0},"台州市":{"椒江区":0,"黄岩区":0,"路桥区":0,"玉环县":0,"三门县":0,"天台县":0,"仙居县":0,"温岭市":0,"临海市":0,"其它区":0},"丽水市":{"莲都区":0,"青田县":0,"缙云县":0,"遂昌县":0,"松阳县":0,"云和县":0,"庆元县":0,"景宁畲族自治县":0,"龙泉市":0,"其它区":0}},"安徽省":{"合肥市":{"瑶海区":0,"庐阳区":0,"蜀山区":0,"包河区":0,"长丰县":0,"肥东县":0,"肥西县":0,"高新区":0,"中区":0,"其它区":0,"巢湖市":0,"居巢区":0,"庐江县":0},"芜湖市":{"镜湖区":0,"弋江区":0,"鸠江区":0,"三山区":0,"芜湖县":0,"繁昌县":0,"南陵县":0,"其它区":0,"无为县":0},"蚌埠市":{"龙子湖区":0,"蚌山区":0,"禹会区":0,"淮上区":0,"怀远县":0,"五河县":0,"固镇县":0,"其它区":0},"淮南市":{"大通区":0,"田家庵区":0,"谢家集区":0,"八公山区":0,"潘集区":0,"凤台县":0,"其它区":0},"马鞍山市":{"金家庄区":0,"花山区":0,"雨山区":0,"当涂县":0,"其它区":0,"含山县":0,"和县":0},"淮北市":{"杜集区":0,"相山区":0,"烈山区":0,"濉溪县":0,"其它区":0},"铜陵市":{"铜官山区":0,"狮子山区":0,"郊区":0,"铜陵县":0,"其它区":0},"安庆市":{"迎江区":0,"大观区":0,"宜秀区":0,"怀宁县":0,"枞阳县":0,"潜山县":0,"太湖县":0,"宿松县":0,"望江县":0,"岳西县":0,"桐城市":0,"其它区":0},"黄山市":{"屯溪区":0,"黄山区":0,"徽州区":0,"歙县":0,"休宁县":0,"黟县":0,"祁门县":0,"其它区":0},"滁州市":{"琅琊区":0,"南谯区":0,"来安县":0,"全椒县":0,"定远县":0,"凤阳县":0,"天长市":0,"明光市":0,"其它区":0},"阜阳市":{"颍州区":0,"颍东区":0,"颍泉区":0,"临泉县":0,"太和县":0,"阜南县":0,"颍上县":0,"界首市":0,"其它区":0},"宿州市":{"埇桥区":0,"砀山县":0,"萧县":0,"灵璧县":0,"泗县":0,"其它区":0},"六安市":{"金安区":0,"裕安区":0,"寿县":0,"霍邱县":0,"舒城县":0,"金寨县":0,"霍山县":0,"其它区":0},"亳州市":{"谯城区":0,"涡阳县":0,"蒙城县":0,"利辛县":0,"其它区":0},"池州市":{"贵池区":0,"东至县":0,"石台县":0,"青阳县":0,"其它区":0},"宣城市":{"宣州区":0,"郎溪县":0,"广德县":0,"泾县":0,"绩溪县":0,"旌德县":0,"宁国市":0,"其它区":0}},"福建省":{"福州市":{"鼓楼区":0,"台江区":0,"仓山区":0,"马尾区":0,"晋安区":0,"闽侯县":0,"连江县":0,"罗源县":0,"闽清县":0,"永泰县":0,"平潭县":0,"福清市":0,"长乐市":0,"其它区":0},"厦门市":{"思明区":0,"海沧区":0,"湖里区":0,"集美区":0,"同安区":0,"翔安区":0,"其它区":0},"莆田市":{"城厢区":0,"涵江区":0,"荔城区":0,"秀屿区":0,"仙游县":0,"其它区":0},"三明市":{"梅列区":0,"三元区":0,"明溪县":0,"清流县":0,"宁化县":0,"大田县":0,"尤溪县":0,"沙县":0,"将乐县":0,"泰宁县":0,"建宁县":0,"永安市":0,"其它区":0},"泉州市":{"鲤城区":0,"丰泽区":0,"洛江区":0,"泉港区":0,"惠安县":0,"安溪县":0,"永春县":0,"德化县":0,"金门县":0,"石狮市":0,"晋江市":0,"南安市":0,"其它区":0},"漳州市":{"芗城区":0,"龙文区":0,"云霄县":0,"漳浦县":0,"诏安县":0,"长泰县":0,"东山县":0,"南靖县":0,"平和县":0,"华安县":0,"龙海市":0,"其它区":0},"南平市":{"延平区":0,"顺昌县":0,"浦城县":0,"光泽县":0,"松溪县":0,"政和县":0,"邵武市":0,"武夷山市":0,"建瓯市":0,"建阳市":0,"其它区":0},"龙岩市":{"新罗区":0,"长汀县":0,"永定县":0,"上杭县":0,"武平县":0,"连城县":0,"漳平市":0,"其它区":0},"宁德市":{"蕉城区":0,"霞浦县":0,"古田县":0,"屏南县":0,"寿宁县":0,"周宁县":0,"柘荣县":0,"福安市":0,"福鼎市":0,"其它区":0}},"江西省":{"南昌市":{"东湖区":0,"西湖区":0,"青云谱区":0,"湾里区":0,"青山湖区":0,"南昌县":0,"新建县":0,"安义县":0,"进贤县":0,"红谷滩新区":0,"经济技术开发区":0,"昌北区":0,"其它区":0},"景德镇市":{"昌江区":0,"珠山区":0,"浮梁县":0,"乐平市":0,"其它区":0},"萍乡市":{"安源区":0,"湘东区":0,"莲花县":0,"上栗县":0,"芦溪县":0,"其它区":0},"九江市":{"庐山区":0,"浔阳区":0,"九江县":0,"武宁县":0,"修水县":0,"永修县":0,"德安县":0,"星子县":0,"都昌县":0,"湖口县":0,"彭泽县":0,"瑞昌市":0,"其它区":0},"新余市":{"渝水区":0,"分宜县":0,"其它区":0},"鹰潭市":{"月湖区":0,"余江县":0,"贵溪市":0,"其它区":0},"赣州市":{"章贡区":0,"赣县":0,"信丰县":0,"大余县":0,"上犹县":0,"崇义县":0,"安远县":0,"龙南县":0,"定南县":0,"全南县":0,"宁都县":0,"于都县":0,"兴国县":0,"会昌县":0,"寻乌县":0,"石城县":0,"黄金区":0,"瑞金市":0,"南康市":0,"其它区":0},"吉安市":{"吉州区":0,"青原区":0,"吉安县":0,"吉水县":0,"峡江县":0,"新干县":0,"永丰县":0,"泰和县":0,"遂川县":0,"万安县":0,"安福县":0,"永新县":0,"井冈山市":0,"其它区":0},"宜春市":{"袁州区":0,"奉新县":0,"万载县":0,"上高县":0,"宜丰县":0,"靖安县":0,"铜鼓县":0,"丰城市":0,"樟树市":0,"高安市":0,"其它区":0},"抚州市":{"临川区":0,"南城县":0,"黎川县":0,"南丰县":0,"崇仁县":0,"乐安县":0,"宜黄县":0,"金溪县":0,"资溪县":0,"东乡县":0,"广昌县":0,"其它区":0},"上饶市":{"信州区":0,"上饶县":0,"广丰县":0,"玉山县":0,"铅山县":0,"横峰县":0,"弋阳县":0,"余干县":0,"鄱阳县":0,"万年县":0,"婺源县":0,"德兴市":0,"其它区":0}},"山东省":{"济南市":{"历下区":0,"市中区":0,"槐荫区":0,"天桥区":0,"历城区":0,"长清区":0,"平阴县":0,"济阳县":0,"商河县":0,"章丘市":0,"其它区":0},"青岛市":{"市南区":0,"市北区":0,"四方区":0,"黄岛区":0,"崂山区":0,"李沧区":0,"城阳区":0,"开发区":0,"胶州市":0,"即墨市":0,"平度市":0,"胶南市":0,"莱西市":0,"其它区":0},"淄博市":{"淄川区":0,"张店区":0,"博山区":0,"临淄区":0,"周村区":0,"桓台县":0,"高青县":0,"沂源县":0,"其它区":0},"枣庄市":{"市中区":0,"薛城区":0,"峄城区":0,"台儿庄区":0,"山亭区":0,"滕州市":0,"其它区":0},"东营市":{"东营区":0,"河口区":0,"垦利县":0,"利津县":0,"广饶县":0,"西城区":0,"东城区":0,"其它区":0},"烟台市":{"芝罘区":0,"福山区":0,"牟平区":0,"莱山区":0,"长岛县":0,"龙口市":0,"莱阳市":0,"莱州市":0,"蓬莱市":0,"招远市":0,"栖霞市":0,"海阳市":0,"其它区":0},"潍坊市":{"潍城区":0,"寒亭区":0,"坊子区":0,"奎文区":0,"临朐县":0,"昌乐县":0,"开发区":0,"青州市":0,"诸城市":0,"寿光市":0,"安丘市":0,"高密市":0,"昌邑市":0,"其它区":0},"济宁市":{"市中区":0,"任城区":0,"微山县":0,"鱼台县":0,"金乡县":0,"嘉祥县":0,"汶上县":0,"泗水县":0,"梁山县":0,"曲阜市":0,"兖州市":0,"邹城市":0,"其它区":0},"泰安市":{"泰山区":0,"岱岳区":0,"宁阳县":0,"东平县":0,"新泰市":0,"肥城市":0,"其它区":0},"威海市":{"环翠区":0,"文登市":0,"荣成市":0,"乳山市":0,"其它区":0},"日照市":{"东港区":0,"岚山区":0,"五莲县":0,"莒县":0,"其它区":0},"莱芜市":{"莱城区":0,"钢城区":0,"其它区":0},"临沂市":{"兰山区":0,"罗庄区":0,"河东区":0,"沂南县":0,"郯城县":0,"沂水县":0,"苍山县":0,"费县":0,"平邑县":0,"莒南县":0,"蒙阴县":0,"临沭县":0,"其它区":0},"德州市":{"德城区":0,"陵县":0,"宁津县":0,"庆云县":0,"临邑县":0,"齐河县":0,"平原县":0,"夏津县":0,"武城县":0,"开发区":0,"乐陵市":0,"禹城市":0,"其它区":0},"聊城市":{"东昌府区":0,"阳谷县":0,"莘县":0,"茌平县":0,"东阿县":0,"冠县":0,"高唐县":0,"临清市":0,"其它区":0},"滨州市":{"滨城区":0,"惠民县":0,"阳信县":0,"无棣县":0,"沾化县":0,"博兴县":0,"邹平县":0,"其它区":0},"菏泽市":{"牡丹区":0,"曹县":0,"单县":0,"成武县":0,"巨野县":0,"郓城县":0,"鄄城县":0,"定陶县":0,"东明县":0,"其它区":0}},"河南省":{"郑州市":{"中原区":0,"二七区":0,"管城回族区":0,"金水区":0,"上街区":0,"惠济区":0,"中牟县":0,"巩义市":0,"荥阳市":0,"新密市":0,"新郑市":0,"登封市":0,"郑东新区":0,"高新区":0,"其它区":0},"开封市":{"龙亭区":0,"顺河回族区":0,"鼓楼区":0,"禹王台区":0,"金明区":0,"杞县":0,"通许县":0,"尉氏县":0,"开封县":0,"兰考县":0,"其它区":0},"洛阳市":{"老城区":0,"西工区":0,"廛河回族区":0,"涧西区":0,"吉利区":0,"洛龙区":0,"孟津县":0,"新安县":0,"栾川县":0,"嵩县":0,"汝阳县":0,"宜阳县":0,"洛宁县":0,"伊川县":0,"偃师市":0,"高新区":0,"其它区":0},"平顶山市":{"新华区":0,"卫东区":0,"石龙区":0,"湛河区":0,"宝丰县":0,"叶县":0,"鲁山县":0,"郏县":0,"舞钢市":0,"汝州市":0,"其它区":0},"安阳市":{"文峰区":0,"北关区":0,"殷都区":0,"龙安区":0,"安阳县":0,"汤阴县":0,"滑县":0,"内黄县":0,"林州市":0,"其它区":0},"鹤壁市":{"鹤山区":0,"山城区":0,"淇滨区":0,"浚县":0,"淇县":0,"其它区":0},"新乡市":{"红旗区":0,"卫滨区":0,"凤泉区":0,"牧野区":0,"新乡县":0,"获嘉县":0,"原阳县":0,"延津县":0,"封丘县":0,"长垣县":0,"卫辉市":0,"辉县市":0,"其它区":0},"焦作市":{"解放区":0,"中站区":0,"马村区":0,"山阳区":0,"修武县":0,"博爱县":0,"武陟县":0,"温县":0,"沁阳市":0,"孟州市":0,"其它区":0},"济源市":0,"濮阳市":{"华龙区":0,"清丰县":0,"南乐县":0,"范县":0,"台前县":0,"濮阳县":0,"其它区":0},"许昌市":{"魏都区":0,"许昌县":0,"鄢陵县":0,"襄城县":0,"禹州市":0,"长葛市":0,"其它区":0},"漯河市":{"源汇区":0,"郾城区":0,"召陵区":0,"舞阳县":0,"临颍县":0,"其它区":0},"三门峡市":{"湖滨区":0,"渑池县":0,"陕县":0,"卢氏县":0,"义马市":0,"灵宝市":0,"其它区":0},"南阳市":{"宛城区":0,"卧龙区":0,"南召县":0,"方城县":0,"西峡县":0,"镇平县":0,"内乡县":0,"淅川县":0,"社旗县":0,"唐河县":0,"新野县":0,"桐柏县":0,"邓州市":0,"其它区":0},"商丘市":{"梁园区":0,"睢阳区":0,"民权县":0,"睢县":0,"宁陵县":0,"柘城县":0,"虞城县":0,"夏邑县":0,"永城市":0,"其它区":0},"信阳市":{"浉河区":0,"平桥区":0,"罗山县":0,"光山县":0,"新县":0,"商城县":0,"固始县":0,"潢川县":0,"淮滨县":0,"息县":0,"其它区":0},"周口市":{"川汇区":0,"扶沟县":0,"西华县":0,"商水县":0,"沈丘县":0,"郸城县":0,"淮阳县":0,"太康县":0,"鹿邑县":0,"项城市":0,"其它区":0},"驻马店市":{"驿城区":0,"西平县":0,"上蔡县":0,"平舆县":0,"正阳县":0,"确山县":0,"泌阳县":0,"汝南县":0,"遂平县":0,"新蔡县":0,"其它区":0}},"湖北省":{"武汉市":{"江岸区":0,"江汉区":0,"硚口区":0,"汉阳区":0,"武昌区":0,"青山区":0,"洪山区":0,"东西湖区":0,"汉南区":0,"蔡甸区":0,"江夏区":0,"黄陂区":0,"新洲区":0,"其它区":0},"黄石市":{"黄石港区":0,"西塞山区":0,"下陆区":0,"铁山区":0,"阳新县":0,"大冶市":0,"其它区":0},"十堰市":{"茅箭区":0,"张湾区":0,"郧县":0,"郧西县":0,"竹山县":0,"竹溪县":0,"房县":0,"丹江口市":0,"城区":0,"其它区":0},"宜昌市":{"西陵区":0,"伍家岗区":0,"点军区":0,"猇亭区":0,"夷陵区":0,"远安县":0,"兴山县":0,"秭归县":0,"长阳土家族自治县":0,"五峰土家族自治县":0,"葛洲坝区":0,"开发区":0,"宜都市":0,"当阳市":0,"枝江市":0,"其它区":0},"襄阳市":{"襄城区":0,"樊城区":0,"襄州区":0,"南漳县":0,"谷城县":0,"保康县":0,"老河口市":0,"枣阳市":0,"宜城市":0,"其它区":0},"鄂州市":{"梁子湖区":0,"华容区":0,"鄂城区":0,"其它区":0},"荆门市":{"东宝区":0,"掇刀区":0,"京山县":0,"沙洋县":0,"钟祥市":0,"其它区":0},"孝感市":{"孝南区":0,"孝昌县":0,"大悟县":0,"云梦县":0,"应城市":0,"安陆市":0,"汉川市":0,"其它区":0},"荆州市":{"沙市区":0,"荆州区":0,"公安县":0,"监利县":0,"江陵县":0,"石首市":0,"洪湖市":0,"松滋市":0,"其它区":0},"黄冈市":{"黄州区":0,"团风县":0,"红安县":0,"罗田县":0,"英山县":0,"浠水县":0,"蕲春县":0,"黄梅县":0,"麻城市":0,"武穴市":0,"其它区":0},"咸宁市":{"咸安区":0,"嘉鱼县":0,"通城县":0,"崇阳县":0,"通山县":0,"赤壁市":0,"温泉城区":0,"其它区":0},"随州市":{"曾都区":0,"随县":0,"广水市":0,"其它区":0},"恩施土家族苗族自治州":{"恩施市":0,"利川市":0,"建始县":0,"巴东县":0,"宣恩县":0,"咸丰县":0,"来凤县":0,"鹤峰县":0,"其它区":0},"仙桃市":0,"潜江市":0,"天门市":0,"神农架林区":0},"湖南省":{"长沙市":{"芙蓉区":0,"天心区":0,"岳麓区":0,"开福区":0,"雨花区":0,"长沙县":0,"望城县":0,"宁乡县":0,"浏阳市":0,"其它区":0},"株洲市":{"荷塘区":0,"芦淞区":0,"石峰区":0,"天元区":0,"株洲县":0,"攸县":0,"茶陵县":0,"炎陵县":0,"醴陵市":0,"其它区":0},"湘潭市":{"雨湖区":0,"岳塘区":0,"湘潭县":0,"湘乡市":0,"韶山市":0,"其它区":0},"衡阳市":{"珠晖区":0,"雁峰区":0,"石鼓区":0,"蒸湘区":0,"南岳区":0,"衡阳县":0,"衡南县":0,"衡山县":0,"衡东县":0,"祁东县":0,"耒阳市":0,"常宁市":0,"其它区":0},"邵阳市":{"双清区":0,"大祥区":0,"北塔区":0,"邵东县":0,"新邵县":0,"邵阳县":0,"隆回县":0,"洞口县":0,"绥宁县":0,"新宁县":0,"城步苗族自治县":0,"武冈市":0,"其它区":0},"岳阳市":{"岳阳楼区":0,"云溪区":0,"君山区":0,"岳阳县":0,"华容县":0,"湘阴县":0,"平江县":0,"汨罗市":0,"临湘市":0,"其它区":0},"常德市":{"武陵区":0,"鼎城区":0,"安乡县":0,"汉寿县":0,"澧县":0,"临澧县":0,"桃源县":0,"石门县":0,"津市市":0,"其它区":0},"张家界市":{"永定区":0,"武陵源区":0,"慈利县":0,"桑植县":0,"其它区":0},"益阳市":{"资阳区":0,"赫山区":0,"南县":0,"桃江县":0,"安化县":0,"沅江市":0,"其它区":0},"郴州市":{"北湖区":0,"苏仙区":0,"桂阳县":0,"宜章县":0,"永兴县":0,"嘉禾县":0,"临武县":0,"汝城县":0,"桂东县":0,"安仁县":0,"资兴市":0,"其它区":0},"永州市":{"零陵区":0,"冷水滩区":0,"祁阳县":0,"东安县":0,"双牌县":0,"道县":0,"江永县":0,"宁远县":0,"蓝山县":0,"新田县":0,"江华瑶族自治县":0,"其它区":0},"怀化市":{"鹤城区":0,"中方县":0,"沅陵县":0,"辰溪县":0,"溆浦县":0,"会同县":0,"麻阳苗族自治县":0,"新晃侗族自治县":0,"芷江侗族自治县":0,"靖州苗族侗族自治县":0,"通道侗族自治县":0,"洪江市":0,"其它区":0},"娄底市":{"娄星区":0,"双峰县":0,"新化县":0,"冷水江市":0,"涟源市":0,"其它区":0},"湘西土家族苗族自治州":{"吉首市":0,"泸溪县":0,"凤凰县":0,"花垣县":0,"保靖县":0,"古丈县":0,"永顺县":0,"龙山县":0,"其它区":0}},"广东省":{"广州市":{"荔湾区":0,"越秀区":0,"海珠区":0,"天河区":0,"白云区":0,"黄埔区":0,"番禺区":0,"花都区":0,"南沙区":0,"萝岗区":0,"增城市":0,"从化市":0,"东山区":0,"其它区":0},"韶关市":{"武江区":0,"浈江区":0,"曲江区":0,"始兴县":0,"仁化县":0,"翁源县":0,"乳源瑶族自治县":0,"新丰县":0,"乐昌市":0,"南雄市":0,"其它区":0},"深圳市":{"罗湖区":0,"福田区":0,"南山区":0,"宝安区":0,"龙岗区":0,"盐田区":0,"其它区":0},"珠海市":{"香洲区":0,"斗门区":0,"金湾区":0,"金唐区":0,"南湾区":0,"其它区":0},"汕头市":{"龙湖区":0,"金平区":0,"濠江区":0,"潮阳区":0,"潮南区":0,"澄海区":0,"南澳县":0,"其它区":0},"佛山市":{"禅城区":0,"南海区":0,"顺德区":0,"三水区":0,"高明区":0,"其它区":0},"江门市":{"蓬江区":0,"江海区":0,"新会区":0,"台山市":0,"开平市":0,"鹤山市":0,"恩平市":0,"其它区":0},"湛江市":{"赤坎区":0,"霞山区":0,"坡头区":0,"麻章区":0,"遂溪县":0,"徐闻县":0,"廉江市":0,"雷州市":0,"吴川市":0,"其它区":0},"茂名市":{"茂南区":0,"茂港区":0,"电白县":0,"高州市":0,"化州市":0,"信宜市":0,"其它区":0},"肇庆市":{"端州区":0,"鼎湖区":0,"广宁县":0,"怀集县":0,"封开县":0,"德庆县":0,"高要市":0,"四会市":0,"其它区":0},"惠州市":{"惠城区":0,"惠阳区":0,"博罗县":0,"惠东县":0,"龙门县":0,"其它区":0},"梅州市":{"梅江区":0,"梅县":0,"大埔县":0,"丰顺县":0,"五华县":0,"平远县":0,"蕉岭县":0,"兴宁市":0,"其它区":0},"汕尾市":{"城区":0,"海丰县":0,"陆河县":0,"陆丰市":0,"其它区":0},"河源市":{"源城区":0,"紫金县":0,"龙川县":0,"连平县":0,"和平县":0,"东源县":0,"其它区":0},"阳江市":{"江城区":0,"阳西县":0,"阳东县":0,"阳春市":0,"其它区":0},"清远市":{"清城区":0,"佛冈县":0,"阳山县":0,"连山壮族瑶族自治县":0,"连南瑶族自治县":0,"清新县":0,"英德市":0,"连州市":0,"其它区":0},"东莞市":0,"中山市":0,"潮州市":{"湘桥区":0,"潮安县":0,"饶平县":0,"枫溪区":0,"其它区":0},"揭阳市":{"榕城区":0,"揭东县":0,"揭西县":0,"惠来县":0,"普宁市":0,"东山区":0,"其它区":0},"云浮市":{"云城区":0,"新兴县":0,"郁南县":0,"云安县":0,"罗定市":0,"其它区":0}},"广西壮族自治区":{"南宁市":{"兴宁区":0,"青秀区":0,"江南区":0,"西乡塘区":0,"良庆区":0,"邕宁区":0,"武鸣县":0,"隆安县":0,"马山县":0,"上林县":0,"宾阳县":0,"横县":0,"其它区":0},"柳州市":{"城中区":0,"鱼峰区":0,"柳南区":0,"柳北区":0,"柳江县":0,"柳城县":0,"鹿寨县":0,"融安县":0,"融水苗族自治县":0,"三江侗族自治县":0,"其它区":0},"桂林市":{"秀峰区":0,"叠彩区":0,"象山区":0,"七星区":0,"雁山区":0,"阳朔县":0,"临桂县":0,"灵川县":0,"全州县":0,"兴安县":0,"永福县":0,"灌阳县":0,"龙胜各族自治县":0,"资源县":0,"平乐县":0,"荔浦县":0,"恭城瑶族自治县":0,"其它区":0},"梧州市":{"万秀区":0,"蝶山区":0,"长洲区":0,"苍梧县":0,"藤县":0,"蒙山县":0,"岑溪市":0,"其它区":0},"北海市":{"海城区":0,"银海区":0,"铁山港区":0,"合浦县":0,"其它区":0},"防城港市":{"港口区":0,"防城区":0,"上思县":0,"东兴市":0,"其它区":0},"钦州市":{"钦南区":0,"钦北区":0,"灵山县":0,"浦北县":0,"其它区":0},"贵港市":{"港北区":0,"港南区":0,"覃塘区":0,"平南县":0,"桂平市":0,"其它区":0},"玉林市":{"玉州区":0,"容县":0,"陆川县":0,"博白县":0,"兴业县":0,"北流市":0,"其它区":0},"百色市":{"右江区":0,"田阳县":0,"田东县":0,"平果县":0,"德保县":0,"靖西县":0,"那坡县":0,"凌云县":0,"乐业县":0,"田林县":0,"西林县":0,"隆林各族自治县":0,"其它区":0},"贺州市":{"八步区":0,"昭平县":0,"钟山县":0,"富川瑶族自治县":0,"其它区":0},"河池市":{"金城江区":0,"南丹县":0,"天峨县":0,"凤山县":0,"东兰县":0,"罗城仫佬族自治县":0,"环江毛南族自治县":0,"巴马瑶族自治县":0,"都安瑶族自治县":0,"大化瑶族自治县":0,"宜州市":0,"其它区":0},"来宾市":{"兴宾区":0,"忻城县":0,"象州县":0,"武宣县":0,"金秀瑶族自治县":0,"合山市":0,"其它区":0},"崇左市":{"江洲区":0,"扶绥县":0,"宁明县":0,"龙州县":0,"大新县":0,"天等县":0,"凭祥市":0,"其它区":0}},"海南省":{"海口市":{"秀英区":0,"龙华区":0,"琼山区":0,"美兰区":0,"其它区":0},"三亚市":0,"五指山市":0,"琼海市":0,"儋州市":0,"文昌市":0,"万宁市":0,"东方市":0,"定安县":0,"屯昌县":0,"澄迈县":0,"临高县":0,"白沙黎族自治县":0,"昌江黎族自治县":0,"乐东黎族自治县":0,"陵水黎族自治县":0,"保亭黎族苗族自治县":0,"琼中黎族苗族自治县":0,"西沙群岛":0,"南沙群岛":0,"中沙群岛的岛礁及其海域":0},"重庆市":{"重庆市":{"万州区":0,"涪陵区":0,"渝中区":0,"大渡口区":0,"江北区":0,"沙坪坝区":0,"九龙坡区":0,"南岸区":0,"北碚区":0,"万盛区":0,"双桥区":0,"渝北区":0,"巴南区":0,"黔江区":0,"长寿区":0,"綦江县":0,"潼南县":0,"铜梁县":0,"大足县":0,"荣昌县":0,"璧山县":0,"梁平县":0,"城口县":0,"丰都县":0,"垫江县":0,"武隆县":0,"忠县":0,"开县":0,"云阳县":0,"奉节县":0,"巫山县":0,"巫溪县":0,"石柱土家族自治县":0,"秀山土家族苗族自治县":0,"酉阳土家族苗族自治县":0,"彭水苗族土家族自治县":0,"江津区":0,"合川区":0,"永川区":0,"南川区":0,"其它区":0}},"四川省":{"成都市":{"锦江区":0,"青羊区":0,"金牛区":0,"武侯区":0,"成华区":0,"龙泉驿区":0,"青白江区":0,"新都区":0,"温江区":0,"金堂县":0,"双流县":0,"郫县":0,"大邑县":0,"蒲江县":0,"新津县":0,"都江堰市":0,"彭州市":0,"邛崃市":0,"崇州市":0,"其它区":0},"自贡市":{"自流井区":0,"贡井区":0,"大安区":0,"沿滩区":0,"荣县":0,"富顺县":0,"其它区":0},"攀枝花市":{"东区":0,"西区":0,"仁和区":0,"米易县":0,"盐边县":0,"其它区":0},"泸州市":{"江阳区":0,"纳溪区":0,"龙马潭区":0,"泸县":0,"合江县":0,"叙永县":0,"古蔺县":0,"其它区":0},"德阳市":{"旌阳区":0,"中江县":0,"罗江县":0,"广汉市":0,"什邡市":0,"绵竹市":0,"其它区":0},"绵阳市":{"涪城区":0,"游仙区":0,"三台县":0,"盐亭县":0,"安县":0,"梓潼县":0,"北川羌族自治县":0,"平武县":0,"高新区":0,"江油市":0,"其它区":0},"广元市":{"利州区":0,"元坝区":0,"朝天区":0,"旺苍县":0,"青川县":0,"剑阁县":0,"苍溪县":0,"其它区":0},"遂宁市":{"船山区":0,"安居区":0,"蓬溪县":0,"射洪县":0,"大英县":0,"其它区":0},"内江市":{"市中区":0,"东兴区":0,"威远县":0,"资中县":0,"隆昌县":0,"其它区":0},"乐山市":{"市中区":0,"沙湾区":0,"五通桥区":0,"金口河区":0,"犍为县":0,"井研县":0,"夹江县":0,"沐川县":0,"峨边彝族自治县":0,"马边彝族自治县":0,"峨眉山市":0,"其它区":0},"南充市":{"顺庆区":0,"高坪区":0,"嘉陵区":0,"南部县":0,"营山县":0,"蓬安县":0,"仪陇县":0,"西充县":0,"阆中市":0,"其它区":0},"眉山市":{"东坡区":0,"仁寿县":0,"彭山县":0,"洪雅县":0,"丹棱县":0,"青神县":0,"其它区":0},"宜宾市":{"翠屏区":0,"宜宾县":0,"南溪县":0,"江安县":0,"长宁县":0,"高县":0,"珙县":0,"筠连县":0,"兴文县":0,"屏山县":0,"其它区":0},"广安市":{"广安区":0,"岳池县":0,"武胜县":0,"邻水县":0,"华蓥市":0,"市辖区":0,"其它区":0},"达州市":{"通川区":0,"达县":0,"宣汉县":0,"开江县":0,"大竹县":0,"渠县":0,"万源市":0,"其它区":0},"雅安市":{"雨城区":0,"名山县":0,"荥经县":0,"汉源县":0,"石棉县":0,"天全县":0,"芦山县":0,"宝兴县":0,"其它区":0},"巴中市":{"巴州区":0,"通江县":0,"南江县":0,"平昌县":0,"其它区":0},"资阳市":{"雁江区":0,"安岳县":0,"乐至县":0,"简阳市":0,"其它区":0},"阿坝藏族羌族自治州":{"汶川县":0,"理县":0,"茂县":0,"松潘县":0,"九寨沟县":0,"金川县":0,"小金县":0,"黑水县":0,"马尔康县":0,"壤塘县":0,"阿坝县":0,"若尔盖县":0,"红原县":0,"其它区":0},"甘孜藏族自治州":{"康定县":0,"泸定县":0,"丹巴县":0,"九龙县":0,"雅江县":0,"道孚县":0,"炉霍县":0,"甘孜县":0,"新龙县":0,"德格县":0,"白玉县":0,"石渠县":0,"色达县":0,"理塘县":0,"巴塘县":0,"乡城县":0,"稻城县":0,"得荣县":0,"其它区":0},"凉山彝族自治州":{"西昌市":0,"木里藏族自治县":0,"盐源县":0,"德昌县":0,"会理县":0,"会东县":0,"宁南县":0,"普格县":0,"布拖县":0,"金阳县":0,"昭觉县":0,"喜德县":0,"冕宁县":0,"越西县":0,"甘洛县":0,"美姑县":0,"雷波县":0,"其它区":0}},"贵州省":{"贵阳市":{"南明区":0,"云岩区":0,"花溪区":0,"乌当区":0,"白云区":0,"小河区":0,"开阳县":0,"息烽县":0,"修文县":0,"金阳开发区":0,"清镇市":0,"其它区":0},"六盘水市":{"钟山区":0,"六枝特区":0,"水城县":0,"盘县":0,"其它区":0},"遵义市":{"红花岗区":0,"汇川区":0,"遵义县":0,"桐梓县":0,"绥阳县":0,"正安县":0,"道真仡佬族苗族自治县":0,"务川仡佬族苗族自治县":0,"凤冈县":0,"湄潭县":0,"余庆县":0,"习水县":0,"赤水市":0,"仁怀市":0,"其它区":0},"安顺市":{"西秀区":0,"平坝县":0,"普定县":0,"镇宁布依族苗族自治县":0,"关岭布依族苗族自治县":0,"紫云苗族布依族自治县":0,"其它区":0},"铜仁地区":{"铜仁市":0,"江口县":0,"玉屏侗族自治县":0,"石阡县":0,"思南县":0,"印江土家族苗族自治县":0,"德江县":0,"沿河土家族自治县":0,"松桃苗族自治县":0,"万山特区":0,"其它区":0},"黔西南布依族苗族自治州":{"兴义市":0,"兴仁县":0,"普安县":0,"晴隆县":0,"贞丰县":0,"望谟县":0,"册亨县":0,"安龙县":0,"其它区":0},"毕节地区":{"毕节市":0,"大方县":0,"黔西县":0,"金沙县":0,"织金县":0,"纳雍县":0,"威宁彝族回族苗族自治县":0,"赫章县":0,"其它区":0},"黔东南苗族侗族自治州":{"凯里市":0,"黄平县":0,"施秉县":0,"三穗县":0,"镇远县":0,"岑巩县":0,"天柱县":0,"锦屏县":0,"剑河县":0,"台江县":0,"黎平县":0,"榕江县":0,"从江县":0,"雷山县":0,"麻江县":0,"丹寨县":0,"其它区":0},"黔南布依族苗族自治州":{"都匀市":0,"福泉市":0,"荔波县":0,"贵定县":0,"瓮安县":0,"独山县":0,"平塘县":0,"罗甸县":0,"长顺县":0,"龙里县":0,"惠水县":0,"三都水族自治县":0,"其它区":0}},"云南省":{"昆明市":{"五华区":0,"盘龙区":0,"官渡区":0,"西山区":0,"东川区":0,"呈贡县":0,"晋宁县":0,"富民县":0,"宜良县":0,"石林彝族自治县":0,"嵩明县":0,"禄劝彝族苗族自治县":0,"寻甸回族彝族自治县":0,"安宁市":0,"其它区":0},"曲靖市":{"麒麟区":0,"马龙县":0,"陆良县":0,"师宗县":0,"罗平县":0,"富源县":0,"会泽县":0,"沾益县":0,"宣威市":0,"其它区":0},"玉溪市":{"红塔区":0,"江川县":0,"澄江县":0,"通海县":0,"华宁县":0,"易门县":0,"峨山彝族自治县":0,"新平彝族傣族自治县":0,"元江哈尼族彝族傣族自治县":0,"其它区":0},"保山市":{"隆阳区":0,"施甸县":0,"腾冲县":0,"龙陵县":0,"昌宁县":0,"其它区":0},"昭通市":{"昭阳区":0,"鲁甸县":0,"巧家县":0,"盐津县":0,"大关县":0,"永善县":0,"绥江县":0,"镇雄县":0,"彝良县":0,"威信县":0,"水富县":0,"其它区":0},"丽江市":{"古城区":0,"玉龙纳西族自治县":0,"永胜县":0,"华坪县":0,"宁蒗彝族自治县":0,"其它区":0},"普洱市":{"思茅区":0,"宁洱哈尼族彝族自治县":0,"墨江哈尼族自治县":0,"景东彝族自治县":0,"景谷傣族彝族自治县":0,"镇沅彝族哈尼族拉祜族自治县":0,"江城哈尼族彝族自治县":0,"孟连傣族拉祜族佤族自治县":0,"澜沧拉祜族自治县":0,"西盟佤族自治县":0,"其它区":0},"临沧市":{"临翔区":0,"凤庆县":0,"云县":0,"永德县":0,"镇康县":0,"双江拉祜族佤族布朗族傣族自治县":0,"耿马傣族佤族自治县":0,"沧源佤族自治县":0,"其它区":0},"楚雄彝族自治州":{"楚雄市":0,"双柏县":0,"牟定县":0,"南华县":0,"姚安县":0,"大姚县":0,"永仁县":0,"元谋县":0,"武定县":0,"禄丰县":0,"其它区":0},"红河哈尼族彝族自治州":{"个旧市":0,"开远市":0,"蒙自县":0,"屏边苗族自治县":0,"建水县":0,"石屏县":0,"弥勒县":0,"泸西县":0,"元阳县":0,"红河县":0,"金平苗族瑶族傣族自治县":0,"绿春县":0,"河口瑶族自治县":0,"其它区":0},"文山壮族苗族自治州":{"文山县":0,"砚山县":0,"西畴县":0,"麻栗坡县":0,"马关县":0,"丘北县":0,"广南县":0,"富宁县":0,"其它区":0},"西双版纳傣族自治州":{"景洪市":0,"勐海县":0,"勐腊县":0,"其它区":0},"大理白族自治州":{"大理市":0,"漾濞彝族自治县":0,"祥云县":0,"宾川县":0,"弥渡县":0,"南涧彝族自治县":0,"巍山彝族回族自治县":0,"永平县":0,"云龙县":0,"洱源县":0,"剑川县":0,"鹤庆县":0,"其它区":0},"德宏傣族景颇族自治州":{"瑞丽市":0,"潞西市":0,"梁河县":0,"盈江县":0,"陇川县":0,"其它区":0},"怒江傈僳族自治州":{"泸水县":0,"福贡县":0,"贡山独龙族怒族自治县":0,"兰坪白族普米族自治县":0,"其它区":0},"迪庆藏族自治州":{"香格里拉县":0,"德钦县":0,"维西傈僳族自治县":0,"其它区":0}},"西藏自治区":{"拉萨市":{"城关区":0,"林周县":0,"当雄县":0,"尼木县":0,"曲水县":0,"堆龙德庆县":0,"达孜县":0,"墨竹工卡县":0,"其它区":0},"昌都地区":{"昌都县":0,"江达县":0,"贡觉县":0,"类乌齐县":0,"丁青县":0,"察雅县":0,"八宿县":0,"左贡县":0,"芒康县":0,"洛隆县":0,"边坝县":0,"其它区":0},"山南地区":{"乃东县":0,"扎囊县":0,"贡嘎县":0,"桑日县":0,"琼结县":0,"曲松县":0,"措美县":0,"洛扎县":0,"加查县":0,"隆子县":0,"错那县":0,"浪卡子县":0,"其它区":0},"日喀则地区":{"日喀则市":0,"南木林县":0,"江孜县":0,"定日县":0,"萨迦县":0,"拉孜县":0,"昂仁县":0,"谢通门县":0,"白朗县":0,"仁布县":0,"康马县":0,"定结县":0,"仲巴县":0,"亚东县":0,"吉隆县":0,"聂拉木县":0,"萨嘎县":0,"岗巴县":0,"其它区":0},"那曲地区":{"那曲县":0,"嘉黎县":0,"比如县":0,"聂荣县":0,"安多县":0,"申扎县":0,"索县":0,"班戈县":0,"巴青县":0,"尼玛县":0,"其它区":0},"阿里地区":{"普兰县":0,"札达县":0,"噶尔县":0,"日土县":0,"革吉县":0,"改则县":0,"措勤县":0,"其它区":0},"林芝地区":{"林芝县":0,"工布江达县":0,"米林县":0,"墨脱县":0,"波密县":0,"察隅县":0,"朗县":0,"其它区":0}},"陕西省":{"西安市":{"新城区":0,"碑林区":0,"莲湖区":0,"灞桥区":0,"未央区":0,"雁塔区":0,"阎良区":0,"临潼区":0,"长安区":0,"蓝田县":0,"周至县":0,"户县":0,"高陵县":0,"其它区":0},"铜川市":{"王益区":0,"印台区":0,"耀州区":0,"宜君县":0,"其它区":0},"宝鸡市":{"渭滨区":0,"金台区":0,"陈仓区":0,"凤翔县":0,"岐山县":0,"扶风县":0,"眉县":0,"陇县":0,"千阳县":0,"麟游县":0,"凤县":0,"太白县":0,"其它区":0},"咸阳市":{"秦都区":0,"杨陵区":0,"渭城区":0,"三原县":0,"泾阳县":0,"乾县":0,"礼泉县":0,"永寿县":0,"彬县":0,"长武县":0,"旬邑县":0,"淳化县":0,"武功县":0,"兴平市":0,"其它区":0},"渭南市":{"临渭区":0,"华县":0,"潼关县":0,"大荔县":0,"合阳县":0,"澄城县":0,"蒲城县":0,"白水县":0,"富平县":0,"韩城市":0,"华阴市":0,"其它区":0},"延安市":{"宝塔区":0,"延长县":0,"延川县":0,"子长县":0,"安塞县":0,"志丹县":0,"吴起县":0,"甘泉县":0,"富县":0,"洛川县":0,"宜川县":0,"黄龙县":0,"黄陵县":0,"其它区":0},"汉中市":{"汉台区":0,"南郑县":0,"城固县":0,"洋县":0,"西乡县":0,"勉县":0,"宁强县":0,"略阳县":0,"镇巴县":0,"留坝县":0,"佛坪县":0,"其它区":0},"榆林市":{"榆阳区":0,"神木县":0,"府谷县":0,"横山县":0,"靖边县":0,"定边县":0,"绥德县":0,"米脂县":0,"佳县":0,"吴堡县":0,"清涧县":0,"子洲县":0,"其它区":0},"安康市":{"汉滨区":0,"汉阴县":0,"石泉县":0,"宁陕县":0,"紫阳县":0,"岚皋县":0,"平利县":0,"镇坪县":0,"旬阳县":0,"白河县":0,"其它区":0},"商洛市":{"商州区":0,"洛南县":0,"丹凤县":0,"商南县":0,"山阳县":0,"镇安县":0,"柞水县":0,"其它区":0}},"甘肃省":{"兰州市":{"城关区":0,"七里河区":0,"西固区":0,"安宁区":0,"红古区":0,"永登县":0,"皋兰县":0,"榆中县":0,"其它区":0},"嘉峪关市":0,"金昌市":{"金川区":0,"永昌县":0,"其它区":0},"白银市":{"白银区":0,"平川区":0,"靖远县":0,"会宁县":0,"景泰县":0,"其它区":0},"天水市":{"秦州区":0,"麦积区":0,"清水县":0,"秦安县":0,"甘谷县":0,"武山县":0,"张家川回族自治县":0,"其它区":0},"武威市":{"凉州区":0,"民勤县":0,"古浪县":0,"天祝藏族自治县":0,"其它区":0},"张掖市":{"甘州区":0,"肃南裕固族自治县":0,"民乐县":0,"临泽县":0,"高台县":0,"山丹县":0,"其它区":0},"平凉市":{"崆峒区":0,"泾川县":0,"灵台县":0,"崇信县":0,"华亭县":0,"庄浪县":0,"静宁县":0,"其它区":0},"酒泉市":{"肃州区":0,"金塔县":0,"安西县":0,"肃北蒙古族自治县":0,"阿克塞哈萨克族自治县":0,"玉门市":0,"敦煌市":0,"其它区":0},"庆阳市":{"西峰区":0,"庆城县":0,"环县":0,"华池县":0,"合水县":0,"正宁县":0,"宁县":0,"镇原县":0,"其它区":0},"定西市":{"安定区":0,"通渭县":0,"陇西县":0,"渭源县":0,"临洮县":0,"漳县":0,"岷县":0,"其它区":0},"陇南市":{"武都区":0,"成县":0,"文县":0,"宕昌县":0,"康县":0,"西和县":0,"礼县":0,"徽县":0,"两当县":0,"其它区":0},"临夏回族自治州":{"临夏市":0,"临夏县":0,"康乐县":0,"永靖县":0,"广河县":0,"和政县":0,"东乡族自治县":0,"积石山保安族东乡族撒拉族自治县":0,"其它区":0},"甘南藏族自治州":{"合作市":0,"临潭县":0,"卓尼县":0,"舟曲县":0,"迭部县":0,"玛曲县":0,"碌曲县":0,"夏河县":0,"其它区":0}},"青海省":{"西宁市":{"城东区":0,"城中区":0,"城西区":0,"城北区":0,"大通回族土族自治县":0,"湟中县":0,"湟源县":0,"其它区":0},"海东地区":{"平安县":0,"民和回族土族自治县":0,"乐都县":0,"互助土族自治县":0,"化隆回族自治县":0,"循化撒拉族自治县":0,"其它区":0},"海北藏族自治州":{"门源回族自治县":0,"祁连县":0,"海晏县":0,"刚察县":0,"其它区":0},"黄南藏族自治州":{"同仁县":0,"尖扎县":0,"泽库县":0,"河南蒙古族自治县":0,"其它区":0},"海南藏族自治州":{"共和县":0,"同德县":0,"贵德县":0,"兴海县":0,"贵南县":0,"其它区":0},"果洛藏族自治州":{"玛沁县":0,"班玛县":0,"甘德县":0,"达日县":0,"久治县":0,"玛多县":0,"其它区":0},"玉树藏族自治州":{"玉树县":0,"杂多县":0,"称多县":0,"治多县":0,"囊谦县":0,"曲麻莱县":0,"其它区":0},"海西蒙古族藏族自治州":{"格尔木市":0,"德令哈市":0,"乌兰县":0,"都兰县":0,"天峻县":0,"其它区":0}},"宁夏回族自治区":{"银川市":{"兴庆区":0,"西夏区":0,"金凤区":0,"永宁县":0,"贺兰县":0,"灵武市":0,"其它区":0},"石嘴山市":{"大武口区":0,"惠农区":0,"平罗县":0,"其它区":0},"吴忠市":{"利通区":0,"红寺堡区":0,"盐池县":0,"同心县":0,"青铜峡市":0,"其它区":0},"固原市":{"原州区":0,"西吉县":0,"隆德县":0,"泾源县":0,"彭阳县":0,"其它区":0},"中卫市":{"沙坡头区":0,"中宁县":0,"海原县":0,"其它区":0}},"新疆维吾尔自治区":{"乌鲁木齐市":{"天山区":0,"沙依巴克区":0,"新市区":0,"水磨沟区":0,"头屯河区":0,"达坂城区":0,"东山区":0,"米东区":0,"乌鲁木齐县":0,"其它区":0},"克拉玛依市":{"独山子区":0,"克拉玛依区":0,"白碱滩区":0,"乌尔禾区":0,"其它区":0},"吐鲁番地区":{"吐鲁番市":0,"鄯善县":0,"托克逊县":0,"其它区":0},"哈密地区":{"哈密市":0,"巴里坤哈萨克自治县":0,"伊吾县":0,"其它区":0},"昌吉回族自治州":{"昌吉市":0,"阜康市":0,"米泉市":0,"呼图壁县":0,"玛纳斯县":0,"奇台县":0,"吉木萨尔县":0,"木垒哈萨克自治县":0,"其它区":0},"博尔塔拉蒙古自治州":{"博乐市":0,"精河县":0,"温泉县":0,"其它区":0},"巴音郭楞蒙古自治州":{"库尔勒市":0,"轮台县":0,"尉犁县":0,"若羌县":0,"且末县":0,"焉耆回族自治县":0,"和静县":0,"和硕县":0,"博湖县":0,"其它区":0},"阿克苏地区":{"阿克苏市":0,"温宿县":0,"库车县":0,"沙雅县":0,"新和县":0,"拜城县":0,"乌什县":0,"阿瓦提县":0,"柯坪县":0,"其它区":0},"克孜勒苏柯尔克孜自治州":{"阿图什市":0,"阿克陶县":0,"阿合奇县":0,"乌恰县":0,"其它区":0},"喀什地区":{"喀什市":0,"疏附县":0,"疏勒县":0,"英吉沙县":0,"泽普县":0,"莎车县":0,"叶城县":0,"麦盖提县":0,"岳普湖县":0,"伽师县":0,"巴楚县":0,"塔什库尔干塔吉克自治县":0,"其它区":0},"和田地区":{"和田市":0,"和田县":0,"墨玉县":0,"皮山县":0,"洛浦县":0,"策勒县":0,"于田县":0,"民丰县":0,"其它区":0},"伊犁哈萨克自治州":{"伊宁市":0,"奎屯市":0,"伊宁县":0,"察布查尔锡伯自治县":0,"霍城县":0,"巩留县":0,"新源县":0,"昭苏县":0,"特克斯县":0,"尼勒克县":0,"其它区":0},"塔城地区":{"塔城市":0,"乌苏市":0,"额敏县":0,"沙湾县":0,"托里县":0,"裕民县":0,"和布克赛尔蒙古自治县":0,"其它区":0},"阿勒泰地区":{"阿勒泰市":0,"布尔津县":0,"富蕴县":0,"福海县":0,"哈巴河县":0,"青河县":0,"吉木乃县":0,"其它区":0},"石河子市":0,"阿拉尔市":0,"图木舒克市":0,"五家渠市":0}}};
            _this.DATA = DATA;
            _this.mode = options.mode||0; //显示模式，0：下拉框默认选中第一个，1：下拉框第一个为“请选择”，2：树视图
            _this.level = options.level||3; //选择的级别，1：只选择省，2：只选择市，3：选到可选项的最后一级
            if(_init)_init.call(_this, options);
            /*var i = 0;
            _this.each(DATA.provinces, function(k, v){
                i++;
                _this.each(v, function(k1, v1){
                    i++;
                    _this.each(v1, function(k2, v2){
                        i++;
                    });
                });
            });
            console.log("I==>", i);*/
        };
        /**
         * 递归到对应的级别，并返回对应的数据
         * @param {String} [province]
         * @param {String} [city]
         * @param {String} [district]
         * @returns {Object}
         */
        _this.getData = function(province, city, district){
            var _this = this;
            var args = [];
            //处理参数
            for(var arg, i=0; arg=arguments[i]; i++){
                if(arg&&args.length==i&&args.length<_this.level){
                    args.push(arg);
                }
            }
            //递归到对应的级别，并返回对应的数据
            var _recursion = function(obj, keys){
                var key = keys[0];
                var data = null;
                if(key){
                    data = obj[key];
                    if(keys.length>1){
                        return _recursion(data, keys.slice(1));
                    }
                }
                return data;
            };
            return args.length?_recursion(_this.DATA.provinces, args):_this.DATA.provinces;
        };
        /**
         * 对象迭代
         * @param {Object} obj 迭代对象
         * @param {Function} callback 迭代对象到每一项时执行
         */
        _this.each = function(obj, callback){
            if(obj&&typeof(obj)==="object"&&callback) {
                for (var o in obj) {
                    if (obj.hasOwnProperty(o) && o !== "" && typeof o == "string") {
                        if(callback(o,obj[o])===false)break;
                    }
                }
            }
        };
        /**
         * 获取/设置DOM属性
         * @param {DOM} o DOM对象
         * @param {String} n 属性名
         * @param {String} [v] 属性值
         * @returns {string}
         */
        _this.attr = function(o, n, v){
            if(o&&n&&v!=null&&o.setAttribute)o.setAttribute(n, v);
            return (o&&n&&o.getAttribute)?o.getAttribute(n):"";
        };

        _this.init(options);
    }

    /**
     * 下拉地址选择器
     * @param {Object} [options]
     * @returns {*}
     * @constructor
     */
    function SelectAddressSelector(options) {
        AddressSelector.call(this, options);
        this.init(options);
    }
    SelectAddressSelector.prototype = {
        /**
         * 初始化
         * @param options
         * @returns {*}
         */
        init: function(options){
            var _this = this;
            options = options||{};
            var slts = document.getElementsByTagName("select");
            var length = slts.length;
            for(var slt, id, suffix, i=0; slt=slts[i]; i++){
                id = slt.id;
                if(!id)continue;
                if(/^pid\-/i.test(id)){
                    _this.initSelect(id.replace(/^pid\-/i, ""), options.province||"",  options.city||"",  options.district||"");
                }
            }
            return _this;
        },
        /**
         * 初始化下拉框
         * @param {String} suffix 后缀
         * @param {String} [province] 省
         * @param {String} [city] 市
         * @param {String} [district] 区
         */
        initSelect: function(suffix, province, city, district){
            var _this = this;
            _this.setProvince(suffix, province, city, district);
            var slt = document.getElementById("pid-"+suffix);
            if(slt){
                slt.onchange = function(s){
                    return function(){
                        _this.setCity(s);
                    }
                }(suffix);
            }
            slt = document.getElementById("cid-"+suffix);
            if(slt){
                slt.onchange = function(s){
                    return function(){
                        _this.setDistrict(s);
                    }
                }(suffix);
            }
            slt = document.getElementById("did-"+suffix);
            if(slt){
                slt.onchange = function(s){
                    return function(){
                        _this.setValue(s);
                    }
                }(suffix);
            }
        },
        /**
         * 设置省
         * @param {String} suffix 后缀
         * @param {String} [province] 省
         * @param {String} [city] 市
         * @param {String} [district] 区
         */
        setProvince: function(suffix, province, city, district){
            var _this = this;
            var hid = document.getElementById("pcd-"+suffix);
            var vals = _this.parseValue(province||(hid?hid.value:"")||"", city, district);
            province = vals.province;
            city = vals.city;
            district = vals.district;
            var slt = document.getElementById("pid-"+suffix);
            province = province||(slt?slt.value:"")||"";
            var mode = slt?_this.attr(slt, "data-mode"):0;
            var data = _this.getData();
            if(slt)slt.length = 0;
            if(data){
                _this.setOptions(slt, data, province, mode);
                if(slt)slt.style.display = "";
            }else{
                if(slt)slt.style.display = "none";
            }
            _this.setCity(suffix, city, district);
        },
        /**
         * 设置市
         * @param {String} suffix 后缀
         * @param {String} [city] 市
         * @param {String} [district] 区
         */
        setCity: function(suffix, city, district){
            var _this = this;
            var slt = document.getElementById("pid-"+suffix);
            var province = (slt?slt.value:"")||"";
            slt = document.getElementById("cid-"+suffix);
            city = city||(slt?slt.value:"")||"";
            var mode = slt?_this.attr(slt, "data-mode"):0;
            var data = _this.getData(province);
            if(slt)slt.length = 0;
            if(data&&province){
                _this.setOptions(slt, data, city, mode);
                if(slt)slt.style.display = "";
            }else{
                if(slt)slt.style.display = "none";
            }
            _this.setDistrict(suffix, district);
        },
        /**
         * 设置区
         * @param {String} suffix 后缀
         * @param {String} [district] 区
         */
        setDistrict: function(suffix, district){
            var _this = this;
            var slt = document.getElementById("pid-"+suffix);
            var province = (slt?slt.value:"")||"";
            slt = document.getElementById("cid-"+suffix);
            var city = (slt?slt.value:"")||"";
            slt = document.getElementById("did-"+suffix);
            district = district||(slt?slt.value:"")||"";
            var mode = slt?_this.attr(slt, "data-mode"):0;
            var data = _this.getData(province, city);
            if(slt)slt.length = 0;
            if(data&&province&&city){
                _this.setOptions(slt, data, district, mode);
                if(slt)slt.style.display = "";
            }else{
                if(slt)slt.style.display = "none";
            }
            _this.setValue(suffix, province, city, district);
        },
        /**
         * 设置下拉框选项
         * @param {DOM} obj DOM对象
         * @param {Object} data 数据
         * @param {String} value 默认值
         * @param {Number} mode 展示模式，默认0，0：默认选中第一个，1：第一项为“请选择”
         */
        setOptions: function(obj, data, value, mode){
            var option = null;
            if(!obj)return;
            obj.length = 0;
            if(mode){
                option = new Option("--请选择--", "");
                obj.options.add(option);
            }
            for(var o in data){
                if(data.hasOwnProperty(o)&&o!==''&&typeof o==='string'){
                    option = new Option(o, o);
                    if(o===value)option.selected = 'selected';
                    obj.options.add(option);
                }
            }
        },
        /**
         * 解析值
         * @param {String} province 省[市区]
         * @param {String} [city] 市
         * @param {String} [district] 区
         */
        parseValue: function(province, city, district){
            var vals = {
                province: province||"",
                city: city||"",
                district: district||""
            };
            if(province){
                var strs = province.split("^");
                vals.province = strs[0]||vals.province;
                vals.city = strs[1]||vals.city;
                vals.district = strs[2]||vals.district;
            }
            return vals;
        },
        /**
         * 设置值
         * @param {String} suffix 后缀
         */
        setValue: function(suffix){
            var slt, hid, value, province = "", city = "", district = "";
            slt = document.getElementById("pid-"+suffix);
            if(slt)value = slt.value||"";
            slt = document.getElementById("cid-"+suffix);
            if(slt)value += "^" + (slt.value||"");
            slt = document.getElementById("did-"+suffix);
            if(slt)value += "^" + (slt.value||"");
            hid = document.getElementById("pcd-"+suffix);
            if(hid)hid.value = value;
        }
    };
    var PCD = new SelectAddressSelector();

    /**
     * 地址多选
     * @param {Object} [options]
     * @constructor
     */
    function AddressMultiSelect(options) {
        AddressSelector.call(this, options);
    }
    AddressMultiSelect.prototype = {
        /**
         * 初始化
         * @param options
         * @returns {*}
         */
        init: function(options){
            var _this = this;
            _this.data = _this.data||{};
            options = options||{};
            _this.$cont = options.$cont||$("#address_multi_select"); //地址树容器
            _this.templateSource = options.templateSource||"template-address_tree_source"; //地址树源
            _this.$source = $("#"+_this.templateSource+"-view");
            _this.templateTarget = options.templateTarget||"template-address_tree_target"; //地址树目标
            _this.$target = $("#"+_this.templateTarget+"-view");
            _this.statuses = options.statuses||{}; //地址选择状态，-1：已使用，0：未选中，1：已选中
            _this.checked = options.checked||[]; //地址选择状态，-1：已使用，0：未选中，1：已选中
            _this.disabled = options.disabled||[]; //地址选择状态，-1：已使用，0：未选中，1：已选中
            _this.events();
            console.log("AddressMultiSelect==>", T.JSON.stringify(_this.checked), T.JSON.stringify(_this.disabled));
            _this.load();
        },
        load: function(){
            var _this = this;
            _this.setDisabled();
            _this.setChecked();
            _this.chkStatuses = {};
            _this.disStatuses = {};
            _this.createData();
            _this.render();
        },
        render: function(){
            var _this = this;
            var top1 = _this.$source.scrollTop();
            var top2 = _this.$target.scrollTop();
            _this.$source.html(Utils.template(_this.templateSource, _this.data));
            _this.$target.html(Utils.template(_this.templateTarget, _this.data));
            _this.$source.scrollTop(top1);
            _this.$target.scrollTop(top2);
            console.log("AddressMultiSelect.load", _this.data);
        },
        /**
         * 设置当前选中的省、市、区
         */
        setChecked: function(){
            var _this = this;
            for(var item="", i=0; item=_this.checked[i]; i++){
                _this.statuses[item] = 1;
            }
        },
        /**
         * 设置已禁用的省、市、区
         */
        setDisabled: function(disabled){
            var _this = this;
            for(var item="", i=0; item=_this.disabled[i]; i++){
                _this.statuses[item] = -1;
            }
        },
        /**
         * 初始化数据
         * @returns {*|{}}
         */
        createData: function(){
            var _this = this;
            /**
             * 递归地址数据
             * @param data 数据源
             * @param obj 目标数据
             * @param level 当前级别
             * @private
             */
            function _recursion(data, obj, level){
                if(level<_this.level){
                    obj.nodeList = obj.nodeList||[];
                }
                obj.level = level||0;
                obj.key = obj.key||"";
                level++;
                _this.each(data, function(k, v){
                    var node = {};
                    node.key = (obj.key+"^"+k).replace(/^\^+|\^+$/, "");
                    node.value = k;
                    node.state = obj.state||_this.statuses[node.key]||0;
                    _recursion(level<_this.level?v:null, node, level);
                    obj.nodeList.push(node);
                });
            }
            var result = {
                key: "",
                value: "全国",
                state: _this.statuses["全国"]||0,
                className: "open"
            };
            _recursion(_this.DATA.provinces, result, 0);
            _this.data.nodeList = [result];
            _this.setState();
        },
        /**
         * 更新数据
         */
        setState: function(state){
            var _this = this;
            /**
             * 递归地址数据
             * @param node 数据源
             * @private
             */
            function _recursion(obj){
                var active = 0;
                var checked = 0;
                var disabled = 0;
                var choosable = 0;
                obj.active = 0;
                obj.checked = 0;
                obj.disabled = 0;
                obj.choosable = 0;
                _this.each(obj.nodeList, function(i, node){
                    _recursion(node);
                    if(!obj.className){
                        node.className = "";
                    }
                    if(node.state==2){
                        active++;
                        node.active++;
                    }else if(node.state==1){
                        checked++;
                        node.checked++;
                    }else if(node.state==-1){
                        disabled++;
                        node.disabled++;
                    }else {
                        choosable++;
                        node.choosable++;
                    }
                    obj.active += node.active;
                    obj.checked += node.checked;
                    obj.disabled += node.disabled;
                    obj.choosable += node.choosable;
                });
                if(obj.nodeList&&obj.nodeList.length){
                    if(active==(obj.nodeList.length - checked - disabled)){
                        obj.state = 2;
                    }
                    if(checked==(obj.nodeList.length - disabled)){
                        obj.state = 1;
                    }
                    if(disabled==obj.nodeList.length){
                        obj.state = -1;
                    }
                }
            }
            _recursion(_this.data.nodeList[0]);
            console.log("location.nodeList", _this.data.nodeList);
        },
        setNodeState: function(node, state, value){
            var _this = this;
            /**
             * 递归地址数据
             * @param nodeList
             * @param key
             * @private
             */
            function _recursion(node, state){
                if(node.state===state){
                    node.state = value;
                }
                _this.each(node.nodeList, function(i, item){
                    _recursion(item, state);
                });
            }
            _recursion(node, state);debugger
        },
        /**
         * 根据key获得节点
         * @param key
         */
        getNodeList: function(key){
            var _this = this;
            var data = null;
            /**
             * 递归地址数据
             * @param nodeList
             * @param key
             * @private
             */
            function _recursion(nodeList, key){
                _this.each(nodeList, function(i, node){
                    if(node.key==key){
                        data = node;
                        return false;
                    }else{
                        _recursion(node.nodeList, key);
                    }
                });
            }
            _recursion(_this.data.nodeList, key);
            return data;
        },
        /**
         * 获取已选择的省、市、区
         * @returns {{data: Array, data2: {}}}
         */
        getChecked: function(){
            var _this = this;
            var data = [], data2 = {};
            /**
             * 递归地址数据
             * @param nodeList
             * @private
             */
            function _recursion(nodeList, obj){
                _this.each(nodeList, function(i, node){
                    if(node.choosable==0&&node.state==1&&node.disabled==0){
                        data.push(node.key||node.value);
                        obj[node.value] = 1;
                    }else{
                        obj[node.value] = {};
                        _recursion(node.nodeList, obj[node.value]);
                    }
                });
            }
            _recursion(_this.data.nodeList, data2);
            debugger;
            var strs = [];
            _this.each(data2, function(k, v){
                if(v){
                    _this.each(v, function(k1, v1){
                        var str = [];
                        _this.each(v1, function(k2, v2){
                            if(v2==1){
                                str.push(k2);
                            }
                        });
                        if(str.length){
                            strs.push(k1+"<em>("+str.join(",")+")</em>");
                        }else if(v1==1){
                            strs.push(k1);
                        }
                    });
                }else if(v==1){
                    strs.push(k);
                }
            });
            return {
                data: data,
                strs: strs.join("、")
            };
        },
        /**
         * 设置树复选
         * @param $this 当前节点容器
         * @param e
         * @param $dom 根容器
         */
        checkNode: function($this, e, $dom){
            var checked = !$this.hasClass("active");
            if(checked){ //选中子级
                $this.addClass("active");
                $("ul>li", $this).addClass("active");
            }else{ //取消选中子级
                $this.removeClass("active");
                $("ul>li", $this).removeClass("active");
            }
            if(checked){ //如果没有子节点被选中，则取消父节点的选中状态
                var parentCheckedState = function($li){
                    if(!$li||!$li.length)return;
                    var $ul = $li.parent().closest("ul", $dom); //当前节点容器
                    if(!$ul||!$ul.length)return;
                    var $lis = $(">li", $ul);
                    var $chks = $(">li.active", $ul);
                    var $cont = $ul.parent();
                    if($cont.is("li")){
                        if($lis.length==$chks.length){//选中子级
                            $cont.addClass("active");
                        }else{ //取消选中子级
                            $cont.removeClass("active");
                        }
                        if($("li.active:not(hid)", $ul).length>0){ //如果当前节点的子节点有选中，则显示当前节点
                            $cont.removeClass("hid");
                        }else{ //否则隐藏
                            $cont.addClass("hid");
                        }
                    }
                    parentCheckedState($cont);
                };
                parentCheckedState($this);
            }else{ //如果当前节点取消选中，则取消所有选中父级节点
                $this.parentsUntil($dom).each(function(i, el){
                    var $el = $(el);
                    if($el.is("li")){ //取消选中
                        $el.removeClass("active");
                    }
                });
            }
        },
        events: function(){
            var _this = this;
            _this.$source.off("click.selctedNode").on("click.selctedNode", "li>a", function(e){ //选中节点
                var $li = $(this).closest("li", _this.$cont);
                var key = $li.data("key")||"";
                var val = $li.data("val")||"";
                var node = _this.getNodeList(key);
                if(node){
                    if($li.hasClass("active")){
                        _this.setNodeState(node, 2, 0);
                    }else{
                        _this.setNodeState(node, 0, 2);
                    }
                }
                _this.checkNode($li, e, _this.$source);
            });
            _this.$target.off("click.removeNode").on("click.removeNode", ".del", function(e){ //删除节点
                var $li = $(this).closest("li", _this.$target);
                var key = $li.data("key")||"";
                var val = $li.data("val")||"";
                var node = _this.getNodeList(key);
                if(node){
                    _this.setNodeState(node, 1, 2);
                    setTimeout(function(){
                        _this.setState();
                    }, 10);
                    setTimeout(function(){
                        _this.render();
                    }, 10);
                }
            });
            _this.$cont.off("click.expandOrCollapse").on("click.expandOrCollapse", ".nav li > .fa:first-child", function(e){ //展开/折叠节点
                var $li = $(this).closest("li", _this.$cont);
                var key = $li.data("key")||"";
                var val = $li.data("val")||"";
                var target = $li.data("target")||"";
                var node = _this.getNodeList(key);
                if(!node)return;
                if($li.hasClass("open")){
                    node.className = "";
                    $li.removeClass("open");
                    $li.stop(true, true).animate({
                        height: 31
                    }, 300);
                }else{
                    node.className = "open";
                    var $ul = $("ul",$li);
                    if($ul.length<1){
                        if(node&&node.nodeList&&node.nodeList.length){
                            $li.append(Utils.template(target>0?_this.templateTarget:_this.templateSource, node));
                            $ul = $("ul",$li);
                        }
                    }
                    if($ul.length>0){
                        $li.stop(true, true).animate({
                            height: $ul.outerHeight(true) + 31
                        }, 300, function(){
                            $li.addClass("open");
                        });
                    }
                }
                return false;
            }).off("click.pushNode").on("click.pushNode", ".bs-tree-add", function(e){ //将左侧选中的节点添加到右侧
                _this.setNodeState(_this.data.nodeList[0], 2, 1);
                _this.setState();
                //_this.chkStatuses = {};
                _this.render();
            });
        }
    };

    PCD.multiSelect = function(options){
        return new AddressMultiSelect(options);
    };

    // AMD module
    if ( typeof define === "function" && define.amd ) {
        define(function(require, exports, module){
            return PCD;
        });
    }else{
        window.PCD = PCD;
    }
}(window, document));