INININ_KEYWORDS_CALLBACK({
    result: '0'
    ,data: {
        result:'0'
        ,data: {
            home: {
                "title": "云印官网—设计“省”心，印刷“简”单！",
                "keywords": "云印,ininin.com,云印技术,云印官网,深圳云印,云印公司,印刷,设计,名片,会员卡,宣传用品,办公用品",
                "description": "云印官网—中国最大的互联网印刷和设计服务平台。为您提供最优质的名片、会员卡、宣传单、折页、易拉宝、X展架、封套、画册、宣传册、手提袋等产品印刷和设计服务！云印技术(深圳)有限公司"
            },
            all: {
                "title": "全部商品分类列表_云印",
                "keywords": "云印,ininin.com,云印技术,云印官网,深圳云印,云印公司,印刷,设计,名片,会员卡,宣传用品,办公用品",
                "description": "云印技术产品分类列表，包括：各种名片、宣传用品、画册、展架、各种营销卡券、各种票据、办公用品等的设计、印刷和制作，一体化服务。"
            },
            category: {//印刷产品分类
                "28": {
                    "title": "办公用品印刷_办公用品印刷价格_办公用品定制_云印",
                    "keywords": "办公用品印刷,办公用品印刷价格,办公用品定制",
                    "description": "云印提供各种常见的办公用品印刷、定做，行业最低价格。可印刷的办公用品包括：信封、信纸、档案袋、PP文件袋、L型文件夹、出库/入库/送货单、点餐/酒水单、收据单等。"
                },
                "29": {
                    "title": "公司宣传用品设计_企业宣传品定制_云印",
                    "keywords": "公司宣传用品设计,企业宣传品定制",
                    "description": "云印是中国最大的互联网印刷和设计服务平台。云印提供常见企业宣传用品的设计、印刷和制作，包括：宣传单、折页、喷绘海报、X展架、易拉宝、门型展架、纸质手提袋、封套等。"
                },
                "30": {
                    "title": "名片制作_名片印刷_二维码名片_云印",
                    "keywords": "名片制作,名片印刷,二维码名片",
                    "description": "云印是中国最大的互联网印刷和设计服务平台。云印提供名片设计、名片制作、名片印刷服务，云印行业领先的名片印刷技术、名片制作工艺是一张优质名片的基础保障。"
                },
                "33": {
                    "title": "企业营销卡卷定制_企业营销卡卷价格_云印",
                    "keywords": "企业营销卡卷定制,企业营销卡卷价格",
                    "description": "云印提供各类的营销卡卷的印刷、设计和制作服务，产品涵盖：代金券、会员卡、购物卡、礼品卡、邀请卡、价格牌等各类印刷营销产品。"
                },
                "36": {
                    "title": "企业画册_画册印刷_画册制作价格_云印",
                    "keywords": "企业画册,画册印刷,画册制作价格",
                    "description": "云印提供企业画册的定制服务，低至2元/本。服务包括企业画册设计、印刷、制作全方位服务，帮助企业展示企业风貌、产品、品牌形象等。"
                }
            }
            ,product: {//印刷产品
                "45": {
                    "title": "L型文件夹印刷_L型文件夹定制_云印",
                    "keywords": "L型文件夹印刷,L型文件夹定制",
                    "description": "云印提供L型文件夹印刷、制作服务，低至1.3元/个。采用PP材质，其优点耐用耐磨、防水防潮、防静电、色彩丰富、耐弯折、不易破碎、可再生利用、环保材料。"
                },
                "46": {
                    "title": "pp文件袋印刷_pp文件袋定制_云印",
                    "keywords": "pp文件袋印刷,pp文件袋定制",
                    "description": "云印提供pp文件袋印刷、制作服务，低至2.4元/个。采用PP材质，其优点耐用耐磨、防水防潮、防静电、色彩丰富、耐弯折、不易破碎、可再生利用、环保材料。"
                },
                "47": {
                    "title": "档案袋印刷_档案袋定做_档案袋印刷价格_云印",
                    "keywords": "档案袋印刷,档案袋定做,档案袋印刷价格",
                    "description": "云印提供档案袋印刷、制作服务，低至1.4元/个。采用150g牛皮纸制成，颜色为黄褐色，纸质柔韧结实，耐破度高，能承受较大拉力和压力不破裂。"
                },
                "48": {
                    "title": "信封印刷_信封定做_信封印刷价格_云印",
                    "keywords": "信封印刷,信封定做,信封印刷价格",
                    "description": "云印提供信封印刷、制作服务，低至0.3元/个的价格就可以展示企业风采。采用双胶纸制成，双胶纸有对油墨的吸收性均匀、平滑度好，质地紧密不透明，抗水性能强等特点。"
                },
                "49": {
                    "title": "信纸印刷_信纸定做_信纸印刷价格_云印",
                    "keywords": "信纸印刷,信纸定做,信纸印刷价格",
                    "description": "云印提供信纸印刷、制作服务，低至5.3元/本的价格就可以展示企业风采。采用双胶纸制成，双胶纸有对油墨的吸收性均匀、平滑度好，质地紧密不透明，抗水性能强等特点。"
                },
                "50": {
                    "title": "X展架印刷_展示架制作_X展架价格_云印",
                    "keywords": "X展架印刷,展示架制作,X展架价格",
                    "description": "云印提供X展架印刷、定制，低至68元/个。X展架是一种用作广告宣传的、背部具有X型支架的展览展示用品，X展架又名产品展示架、促销架、便携式展具和资料架等。"
                },
                "51": {
                    "title": "封套印刷_封套制作_封套印刷价格_云印",
                    "keywords": "封套印刷,封套制作,封套印刷价格",
                    "description": "云印定做封套，低至0.98元/个。封套可以看做是样本的封面和封底，在纸张的选择上可以选择厚一点的纸张铜版纸，而且铜版纸具有平滑度高、光泽度好、色泽艳丽等特点。"
                },
                "52": {
                    "title": "海报制作_海报印刷_海报印刷价格_云印",
                    "keywords": "海报制作,海报印刷,海报印刷价格",
                    "description": "云印提供A0/A1/A2宣传海报印刷、设计、制作，低至6元/张。海报是企业常用的宣传工具，背面带胶海报顾名思义是指背部有粘胶可直接进行粘贴，背面不带胶则需用外物进行粘贴。"
                },
                "53": {
                    "title": "纸手提袋_纸手提袋印刷_纸手提袋定做_纸手提袋价格_云印",
                    "keywords": "纸手提袋,纸手提袋印刷,纸手提袋定做,纸手提袋价格",
                    "description": "云印提供纸质手提袋的印刷、制作和设计，低至1.45元/个。一个好的手提袋既可以为客户提供方便，同时也可以帮助企业宣传品牌，是目前最有效率而又物美价廉的广告媒体之一。"
                },
                "54": {
                    "title": "A3/A4/A5宣传单设计_宣传单印刷_宣传单价格_云印",
                    "keywords": "A3/A4/A5宣传单设计,宣传单印刷,宣传单价格",
                    "description": "157g双铜纸制作双面四色印刷，双铜纸宣传单，纸质均匀紧密，光洁平整，平滑度高，光泽度好， 使印出的图形、画面具有立体感。有A3/A4/A5宣传单多尺寸可选，低至0.06元/张。"
                },
                "55": {
                    "title": "易拉宝印刷_易拉架制作_易拉宝价格_云印",
                    "keywords": "易拉宝印刷,易拉架制作,易拉宝价格",
                    "description": "云印提供易拉宝印刷、定制，低至98元/个。易拉宝或称海报架、展示架、易拉架、易拉得、易拉卷等，是树立式宣传海报，适用于会议、展览、销售宣传等场合，是常见的便携展具。"
                },
                "57": {
                    "title": "铂金拉丝名片设计_铂金拉丝名片制作_铂金拉丝名片报价_云印",
                    "keywords": "铂金拉丝名片设计,铂金拉丝名片制作,铂金拉丝名片报价",
                    "description": "铂金拉丝名片采用PVC材质，高贵明亮的表面呈现精细的拉丝效果，华贵而稳重，多用于高端商务社交场合。报价：最便宜60元至最贵75元/盒(100张)，默认圆角处理。"
                },
                "58": {
                    "title": "七彩镭射名片_变色名片制作_流光溢彩名片报价_云印",
                    "keywords": "七彩镭射名片,变色名片制作,流光溢彩名片",
                    "description": "流光溢彩名片采用PVC材质，在不同的光线下呈现出七彩镭射效果，绚丽惹眼，适合服装、珠宝、化妆品等行业人士选择。报价：最便宜60元至最贵75元/盒(100张)，默认圆角处理。"
                },
                "59": {
                    "title": "PVC名片设计_PVC名片制作_PVC名片报价_云印",
                    "keywords": "PVC名片设计,PVC名片制作,PVC名片报价",
                    "description": "PVC冷调珠光名片采用防油、防水、回弹性好的PVC材质，表面呈现星星点点的珠光效果，时尚感较强，适合都市女性。报价：最便宜40元至最贵55元/盒(100张)，默认圆角处理。"
                },
                "60": {
                    "title": "透明磨砂名片设计_透明磨砂名片制作_透明磨砂名片报价_云印",
                    "keywords": "透明磨砂名片设计,透明磨砂名片制作,透明磨砂名片报价",
                    "description": "透明磨砂名片为PVC材质，防油、防水、回弹性好，透明磨砂效果带有较强未来感，是体现个性设计的好选择。报价：最便宜20元至最贵30元/盒(100张)，透明磨砂名片默认圆角。"
                },
                "61": {
                    "title": "铜版纸名片设计_铜版纸名片制作_铜版纸名片报价_云印",
                    "keywords": "铜版纸名片设计,铜版纸名片制作,铜版纸名片报价",
                    "description": "高档300克铜版纸，具有手感厚重，笔直挺括，质地密实、高白度、设计表现强特点。报价：最便宜3.5元至最贵59元/盒(100张)，多款铜版纸名片，5种可选铜版纸名片处理工艺。"
                },
                "62": {
                    "title": "安格纸名片设计_安格纸名片制作_安格纸名片报价_云印",
                    "keywords": "安格纸名片设计,安格纸名片制作,安格纸名片报价",
                    "description": "安格纸特有细方格纹路，适用于承载活泼明快的设计性元素，兼具艳丽效果和美术纸的质感。报价：最便宜9.9元至最贵53元/盒(100张)，4种可选安格纸名片处理工艺。"
                },
                "63": {
                    "title": "冰白纸名片设计_冰白纸名片制作_冰白纸名片报价_云印",
                    "keywords": "冰白纸名片设计,冰白纸名片制作,冰白纸名片报价",
                    "description": "冰白纸表面呈现星星点点的珠光效果，时代感较强，适合高科技从业人员。报价：最便宜9.9元至最贵53元/盒(100张)，4种可选冰白纸名片处理工艺。"
                },
                "64": {
                    "title": "布纹纸名片设计_布纹纸名片制作_布纹纸名片报价_云印",
                    "keywords": "布纹纸名片设计,布纹纸名片制作,布纹纸名片报价",
                    "description": "布纹纸通过表面纵横交错的细密纹理来体现质感，纸张柔白素雅，适合中国古典水墨之风的名片设计方案。报价：最便宜9.9元至最贵53元/盒(100张)，4种可选布纹纸名片处理工艺。"
                },
                "65": {
                    "title": "蛋壳纸名片设计_蛋壳纸名片制作_蛋壳纸名片报价_云印",
                    "keywords": "蛋壳纸名片设计,蛋壳纸名片制作,蛋壳纸名片报价",
                    "description": "蛋壳纸其表面纹理细腻犹如蛋壳表面，颜色呈现真实柔和，多用于体现一个人的艺术家气质。报价：最便宜9.9元至最贵53元/盒(100张)，4种可选蛋壳纸名片处理工艺。"
                },
                "66": {
                    "title": "刚古纸名片设计_刚古纸名片制作_刚古纸名片报价_云印",
                    "keywords": "刚古纸名片设计,刚古纸名片制作,刚古纸名片报价",
                    "description": "刚古纸表面特有水纹纹理，印刷后颜色略显深沉，是表达绅士风度和稳重气质的良好选择。报价：最便宜9.9元至最贵53元/盒(100张)，4种可选刚古纸名片处理工艺。"
                },
                "67": {
                    "title": "荷兰白纸名片设计_荷兰白纸名片制作_荷兰白纸名片报价_云印",
                    "keywords": "荷兰白纸名片设计,荷兰白纸名片制作,荷兰白纸名片报价",
                    "description": "荷兰白纸，纸张呈现自然的亚光色，吸墨性强，极强的色彩表现力，适合印刷层次丰富、细节复杂的图案。报价：最便宜9.9元至最贵53元/盒(100张)，4种可选名片处理工艺。"
                },
                "83": {
                    "title": "企业代金券印刷_代金券定制_代金券印刷价格_云印",
                    "keywords": "企业代金券印刷,代金券定制,代金券印刷价格",
                    "description": "云印提供企业商家代金券印刷、制作服务，低至0.025元/张的价格。代金券作为商家促销手段的一种，通常附送在消费过程后，用于在购物中抵扣同样等值的现金使用。"
                },
                "84": {
                    "title": "购物卡定做_购物卡印刷价格_购物卡生产价格_云印",
                    "keywords": "购物卡定做,购物卡印刷价格,购物卡生产价格",
                    "description": "云印提供企业商家购物卡印刷、制作服务，低至0.16元/张的价格。购物卡是商家带动提前消费的一种手段，也是企业品牌化的一个重要标志，能在一定程度上反应该商家的发展程度。"
                },
                "85": {
                    "title": "价格牌印刷_价格牌定制_价格牌定做价格_云印",
                    "keywords": "价格牌印刷,价格牌定制,价格牌定做价格",
                    "description": "云印提供价格牌印刷、制作服务，低至7元/盒的价格。价格牌几乎应用于所有企业，用于展示商品的价格，可以采用不同的印刷和设计方式来表现商家不同的销售主题。"
                },
                "86": {
                    "title": "礼品卡印刷_礼品卡生产价格_礼品卡定做_云印",
                    "keywords": "礼品卡印刷,礼品卡生产价格,礼品卡定做",
                    "description": "云印提供企业商家礼品卡印刷、制作服务，低至0.16元/张的价格。礼品卡的赠送一般不需要特别附加金额成本，可作为维系客户、员工福利、商务馈赠、节日礼品的一种选择。"
                },
                "87": {
                    "title": "邀请卡印刷_邀请卡定制_邀请卡定做价格_云印",
                    "keywords": "邀请卡印刷,邀请卡定制,邀请卡定做价格",
                    "description": "云印提供企业商家礼品卡印刷、制作服务，低至3.5元/盒的价格。邀请卡采用300g铜版纸制作，适用于一些特殊场景，如企业开业、上市，是提高知名度的手段之一。"
                },
                "101": {
                    "title": "A4横版画册印刷_A4横版画册定制_A4横版画册价格_云印",
                    "keywords": "A4横版画册印刷,A4横版画册定制,A4横版画册价格",
                    "description": "云印提供A4横版画册的定制服务，低至2元/本。A4横版画册使用双铜纸制作,装订方式:骑马钉、无线胶装，封面可过光胶、过哑胶、双面四色印刷、加击凸、烫金、烫银、加UV等处理工艺。"
                },
                "102": {
                    "title": "A4竖版画册印刷_A4竖版画册定制_A4竖版画册价格_云印",
                    "keywords": "A4竖版画册印刷,A4竖版画册定制,A4竖版画册价格",
                    "description": "云印提供A4竖版画册的定制服务，低至2元/本。A4竖版画册使用双铜纸制作,装订方式:骑马钉、无线胶装，封面可过光胶、过哑胶、双面四色印刷、加击凸、烫金、烫银、加UV等处理工艺。"
                },
                "103": {
                    "title": "A5竖版画册印刷_A5竖版画册定制_A5竖版画册价格_云印",
                    "keywords": "A5竖版画册印刷,A5竖版画册定制,A5竖版画册价格",
                    "description": "云印提供A5竖版画册的定制服务，低至2元/本。A5竖版画册使用双铜纸制作,装订方式:骑马钉、无线胶装，封面可过光胶、过哑胶、双面四色印刷、加击凸、烫金、烫银、加UV等处理工艺。"
                },
                "104": {
                    "title": "小型掌上画册印刷_小型掌上画册定制_小型掌上画册价格_云印",
                    "keywords": "小型掌上画册印刷,小型掌上画册定制,小型掌上画册价格",
                    "description": "云印提供小型掌上画册的定制服务，低至2元/本。小型掌上画册使用双铜纸制作,装订方式:骑马钉、无线胶装，封面可过光胶、过哑胶、双面四色印刷、加击凸、烫金、烫银、加UV等处理工艺。"
                },
                "106": {
                    "title": "二折页印刷_二折页定制_二折页广告单价格_云印",
                    "keywords": "二折页印刷,二折页定制,二折页广告单价格",
                    "description": "宣传折页多用于定向宣传，如：开业宣传、活动告示等。它具有全面而详实的表达特点。采用双铜纸材料制作，纸面光亮，色彩效果鲜艳。二折页宣传单多尺寸可选，低至0.0315元/张。"
                },
                "108": {
                    "title": "三折页印刷_三折页定制_三折页广告单价格_云印",
                    "keywords": "三折页印刷,三折页定制,三折页广告单价格",
                    "description": "三折页宣传单采用双铜纸材料制作，双铜纸纸质紧密，纸面光亮，色彩效果鲜艳。云印提供三折页宣传单的设计、印刷、制作服务，三折页可选荷包折、风琴折，低至0.055元/张。"
                },
                "109": {
                    "title": "四折页印刷_四折页定制_四折页广告单价格_云印",
                    "keywords": "四折页印刷,四折页定制,四折页广告单价格",
                    "description": "四折页宣传单采用双铜纸材料制作，双铜纸纸质紧密，纸面光亮，色彩效果鲜艳。云印提供四折页宣传单的设计、印刷、制作服务，四折页可选关门再对折、风琴折，低至0.11元/张。"
                },
                "111": {
                    "title": "门型展架印刷_门型展架制作_门型展架价格_云印",
                    "keywords": "门型展架印刷,门型展架制作,门型展架价格",
                    "description": "云印提供门型展架印刷、定制，低至170元/个。门型展架是非常常见的一种广告宣传方式，两边有支架、中间有横梁，下方有底座(铁座/注水底座)，形状类似门框。"
                },
                "113": {
                    "title": "企业会员卡印刷_会员卡定制_会员卡印刷价格_云印",
                    "keywords": "企业会员卡印刷,会员卡定制,会员卡印刷价格",
                    "description": "云印提供企业商家会员卡印刷、制作服务，低至0.16元/张的价格。会员卡是商户绑定客源的一种重要方法，其使用范围非常广，如商场、宾馆、娱乐场所等各式各样的场合。"
                },
                "115": {
                    "title": "出入库单据印刷_送货单印刷_云印",
                    "keywords": "出入库单据印刷,送货单印刷",
                    "description": "云印提供出入库单据定制、印刷服务，低至2.32元/本。单据是企业常用的重要凭证。常用的单据有，出库单、入库单、送货单、酒水单、收据单、点餐单等，可按需选择或定制。"
                },
                "117":{
                    "title":"点餐单定制_点餐单印刷_云印",
                    "keywords":"点餐单定制,点餐单印刷",
                    "description":"云印提供点餐单定制、印刷服务，低至2.77元/本。点餐单又叫点菜单、取菜单或出品单，服务员根据客人点菜的内容和要求开立的用于到厨房、吧台拿取菜肴、酒水等食品的书面凭证。"
                },
                "120":{
                    "title":"收据印刷_收据定制_收据印刷价格_云印",
                    "keywords":"收据印刷,收据定制,收据印刷价格",
                    "description":"云印提供单据定制、印刷服务，低至2.32元/本。收据是企事业单位在经济活动中使用的原始凭证，主要是指财政部门印制的盖有财政票据监制章的的收付款凭证，用于行政事业性收入。"
                },
                "121":{
                    "title":"定制票据印刷_定制票据制作_云印",
                    "keywords":"定制票据印刷,定制票据制作",
                    "description":"云印提供定制票据印刷、制作服务，低至1.81元/本。定制票据内包含了所有尺寸类型的票据，用户可以根据自己的需求选择相应的票据类型，联系设计师或自行上传相关的文件格式。"
                },
                "122":{
                    "title":"皮革笔记本_记事本定做_记事本定做报价_云印",
                    "keywords":"皮革笔记本,记事本定做,记事本定做报价",
                    "description":"云印提供皮革笔记本设计、皮革笔记本定做服务，记事本为企业个人办公常用品，云印提供定制服务，可以在记事本上进行企业品牌宣传、烙上品牌的印记。"
                },
                "124":{
                    "title":"屏幕清洁贴_随意贴定制_随意贴报价_云印",
                    "keywords":"屏幕清洁贴,随意贴定制,随意贴报价",
                    "description":"云印提供屏幕清洁贴定制服务,包括随意贴图案设计、随意贴定制低至0.9元张起。随意贴的屏幕清洁功能非常实用，还可以定制印上喜欢的图案、logo帮助企业进行品牌宣传。"
                },
                "126":{
                    "title":"牛皮纸名片_牛卡纸名片_牛皮纸名片制作报价_云印技术",
                    "keywords":"牛皮纸名片,牛卡纸名片,牛皮纸名片制作,牛卡纸名片报价",
                    "description":"牛卡纸名片属于特种纸名片，枫叶牛卡纸产于加拿大，具有枫叶一样的颜色、牛仔布一样的纹路，能非常好的体现出一个人的稳重和成熟。牛卡纸名片报价为160元/盒起。"
                },
                "127":{
                    "title":"滑面纸名片制作_滑面纸名片印刷_滑面纸名片报价_云印技术",
                    "keywords":"滑面纸名片制作,滑面纸名片印刷,滑面纸名片报价",
                    "description":"滑面纸属于特种印刷用纸，滑面纸随着时间的流逝,纸张不易变黄.纸质表面平整,清洁,色泽温和而自然,印刷后视觉感尤为舒适愉悦,滑面纸名片报价为160元/盒起。"
                },
                "128":{
                    "title":"天鹅绒名片制作_天鹅绒名片印刷_天鹅绒名片报价_云印技术",
                    "keywords":"天鹅绒名片制作,天鹅绒名片印刷,天鹅绒名片报价",
                    "description":"名片有天鹅绒一样的触感，天鹅绒纸名片属于特种纸名片，表面平整柔滑，触感细腻，烫金不掉色，可单双面不同的颜色、压制各种纹路。天鹅绒纸名片报价为180元/盒起。"
                },
                "130":{
                    "title":"环保纸袋印刷_环保纸袋定制_环保纸袋报价_云印技术",
                    "keywords":"环保纸袋印刷,环保纸袋定制,环保纸袋报价",
                    "description":"环保纸袋现在越来月常见，环保纸袋不单环保，通过美妙的设计、精致的印刷工艺之后，环保纸袋不仅个性还非常适合用于企业宣传。环保纸袋制作报价0.7元/个起。"
                },
                "131":{
                    "title":"柏芙纸名片_柏芙纸名片印刷_柏芙纸名片制作_云印技术",
                    "keywords":"柏芙纸名片,柏芙纸名片印刷,柏芙纸名片制作,柏芙纸名片报价",
                    "description":"柏芙纸属于特种印刷用纸，在名片印刷、制作行业里，柏芙纸用来制作高档名片，柏芙纸的特性配合先进印刷工艺可以实现各种精美效果。柏芙纸名片报价为160元/盒起。"
                },
                "135":{
                    "title":"亚克力标牌_亚克力塑料标牌_亚克力板标识牌_云印技术",
                    "keywords":"亚克力标牌,亚克力塑料标牌,亚克力板标识牌",
                    "description":"亚克力板是化学材料，有人把它称之为巧克力板，亚克力板常用来做标识牌，办公室最为常用的办公用品。云印提供亚克力板标牌定制服务，5mm亚克力板标识牌仅35元/个起。"
                },
                "136":{
                    "title":"亚巧克力标识牌_亚克力板标志_亚克力指示牌_云印技术",
                    "keywords":"亚巧克力标识牌,亚克力板标志,亚克力指示牌",
                    "description":"亚克力指示牌是最常用的材质，亚克力有非常高的透明度，比玻璃更有韧性、不容易碎，用作指示牌较为安全，8mm亚克力板标识牌仅50元/个起。"
                }
            },
            package: {
                "index": {
                    title: '云印官网—设计“省”心，印刷“简”单！',
                    keywords:'云印,ininin.com,云印技术,云印官网,深圳云印,云印公司,印刷,设计,名片,会员卡,宣传用品,办公用品',
                    description:'云印官网—中国最大的互联网印刷和设计服务平台。为您提供最优质的名片、会员卡、宣传单、折页、易拉宝、X展架、封套、画册、宣传册、手提袋等产品印刷和设计服务！云印技术(深圳)有限公司'
                }
            }
            ,design: {//设计服务
                "index": {
                    "title": "设计服务频道_云印",
                    "keywords": "云印,ininin.com,云印技术,云印官网,深圳云印,云印公司,印刷,设计,名片,会员卡,宣传用品,办公用品",
                    "description": "云印设计服务频道，云印提供各种印刷品设计服务、印刷服务、制作。云印，设计“省”心，印刷“简”单。"
                },
                "list": {
                    "title": "设计服务产品列表_云印",
                    "keywords": "云印,ininin.com,云印技术,云印官网,深圳云印,云印公司,印刷,设计,名片,会员卡,宣传用品,办公用品",
                    "description": "云印设计服务产品列表"
                },
                "9": {
                    "title": "名片设计_名片设计费用_个性名片设计_云印",
                    "keywords": "名片设计,名片设计费用,个性名片设计",
                    "description": "云印提供名片设计服务，包括名片原创设计、名片仿制设计，云印名片设计费用为原创设计100元，名片仿制设计50元。云印云集优秀设计师为您服务，云印让设计更简单。"
                },
                "10": {
                    "title": "会员卡设计_会员卡设计费用_会员卡制作_个性化会员卡_云印",
                    "keywords": "会员卡设计,会员卡设计费用,会员卡制作,个性化会员卡",
                    "description": "云印提供会员卡设计、个性化会员卡制作服务,会员卡印上企业logo和宣传语，帮助企业宣传。云印会员卡原创设计100元、仿制设计50元，云印邀您体验会员卡设计服务。"
                },
                "11": {
                    "title": "LOGO设计_logo设计价格_标志设计_商标设计_云印",
                    "keywords": "LOGO设计,logo设计价格,标志设计,商标设计",
                    "description": "logo(商标)作为一个企业的标志，对于一个企业来说非常重要，云印提供logo设计的各种需求服务，从简单仿制设计到精致原创设计,价格从100至2000不等。"
                },
                "12": {
                    "title": "设计修改",
                    "keywords": "设计修改",
                    "description": "设计修改"
                },
                "13": {
                    "title": "易拉宝设计_易拉宝设计价格_云印",
                    "keywords": "易拉宝设计,易拉宝设计价格",
                    "description": "云印提供易拉宝设计服务，云印优秀设计师提供行业底价的易拉宝设计费用，仿制50元，原创设计100元。"
                },
                "14": {
                    "title": "X展架设计_展架设计价格_展架设计报价_云印",
                    "keywords": "X展架设计,展架设计价格,展架设计报价",
                    "description": "云印云集大量优秀设计师，云印提供行业最低价的X展架设计服务，云印希望以最低的展架设计报价给您优惠。云印，设计“省”心，印刷“简”单。"
                },
                "15": {
                    "title": "手袋设计_手提袋设计_手提袋包装设计_云印",
                    "keywords": "手袋设计,手提袋设计,手提袋包装设计,手提袋设计报价",
                    "description": "云印提供手提袋包装设计服务，云印手提袋设计报价为行业最低价，手提袋设计原创设计仅仅100元，云印希望和您互利双赢。云印，设计“省”心，印刷“简”单。"
                },
                "16": {
                    "title": "封套设计_明信片封套设计_企业封套设计_云印",
                    "keywords": "封套设计,明信片封套设计,企业封套设计",
                    "description": "云印封套设计报价优惠期，原创封套设计仅仅100元。封套设计类型包括：企业封套设计、明信片封套设计、CD封套设计、光盘封套设计等等。"
                },
                "17": {
                    "title": "办公文件夹设计_L型文件夹设计_文件夹设计报价_云印",
                    "keywords": "办公文件夹设计,L型文件夹设计,文件夹设计报价",
                    "description": "即日起云印办公文件夹设计费优惠启动，原创办公文件夹设计仅100元，云印云集优秀设计师，为您的企业品牌形象宣传增添色彩。"
                },
                "18": {
                    "title": "收据设计_票据设计报价_企业票据设计_云印",
                    "keywords": "收据设计,票据设计报价,企业票据设计",
                    "description": "云印提供企业票据设计定制服务，根据不同的应用场合设计、定制不同规格的票据，以满足企业对票据的需求，增加企业形象的烙印。"
                },
                "19": {
                    "title": "信封设计_信封设计报价_企业信封设计_云印",
                    "keywords": "信封设计,信封设计报价,企业信封设计",
                    "description": "云印提供企业信封定制服务，包括企业信封设计和印刷，云印原创信封设计报价仅仅100元，云印，设计“省”心，印刷“简”单。"
                },
                "20": {
                    "title": "信纸设计_公司信纸设计_信纸定制报价_云印",
                    "keywords": "信纸设计,公司信纸设计,信纸定制报价",
                    "description": "云印提供专业的公司办公信纸设计，云印原创信纸设计，仅仅收取100元设计费，即可在企业日常办公信纸上进行企业形象宣传。云印，设计“省”心，印刷“简”单。"
                },
                "21": {
                    "title": "档案袋设计_档案袋设计报价_文件袋设计_云印",
                    "keywords": "档案袋设计,档案袋设计报价,文件袋设计",
                    "description": "云印提供档案袋设计服务，云印云集优秀设计师为您提供文件袋的设计服务，云印原创文件袋设计仅仅收取100元服务费。云印，设计“省”心，印刷“简”单。"
                },
                "22": {
                    "title": "文件袋设计",
                    "keywords": "文件袋设计",
                    "description": "文件袋设计"
                },
                "23": {
                    "title": "宣传单设计_宣传单页设计_广告宣传单设计_云印",
                    "keywords": "宣传单设计,宣传单页设计,广告宣传单设计",
                    "description": "宣传单是最为常见的一种宣传用品，一张设计精美的宣传单，直接为企业的宣传形象加分，云印提供企业宣传单设计服务，原创广告宣传单页设计费仅收取200元。"
                },
                "24": {
                    "title": "海报设计_宣传海报设计_海报设计报价_云印",
                    "keywords": "海报设计,宣传海报设计,海报设计报价",
                    "description": "云印优秀设计师为您提供广告宣传海报设计,原创海报设计费仅200元。云印，设计“省”心，印刷“简”单。"
                },
                "25": {
                    "title": "折页设计_三折页设计_折页设计报价_云印",
                    "keywords": "折页设计,三折页设计,折页设计报价，折页宣传单设计",
                    "description": "云印提供折页宣传单设计，原创折页宣传单设计费用仅350元，折页宣传单是企业最常用的宣传用品。云印，设计“省”心，印刷“简”单。"
                },
                "26": {
                    "title": "画册设计_品牌画册设计_宣传画册设计费用_云印",
                    "keywords": "画册设计,品牌画册设计,宣传画册设计费用",
                    "description": "云印高级设计师提供企业品牌宣传画册设计，企业原创画册设计费用仅500元/面，企业品牌画册是企业对外宣传自身文化、产品特点的重要形式，是企业对外的一张名片。"
                },
                "27": {
                    "title": "优惠券设计_代金券设计_抽奖券设计_云印",
                    "keywords": "优惠券设计,代金券设计,抽奖券设计",
                    "description": "云印提供企业常用宣传用品的设计和印刷服务，包括企业优惠券设计、代金券设计、抽奖券设计等服务，原创优惠券设计仅仅200元。云印，设计“省”心，印刷“简”单。"
                },
                "28": {
                    "title": "展架设计_门型展架设计_门型展架设计报价_云印",
                    "keywords": "展架设计,门型展架设计,门型展架设计报价",
                    "description": "云印提供展架设计、印刷服务，云印门型展架原创设计报价仅100元，云印展架设计是深圳同行业最低的价格。云印，设计“省”心，印刷“简”单。"
                }
            }
        }
    }
});