define("product/config/com", ["base", "tools"], function($, T){
    "use strict";
    //产品配置
    var albumConfig = {
        "装订方式": {
            "骑马钉": {
                "内文克重（g）": {
                    "105": {
                        "内文P数": [4, 8, 12, 16, 20, 24, 28, 32, 36, 40, 44, 48, 52]
                    },
                    "128": {
                        "内文P数": [4, 8, 12, 16, 20, 24, 28, 32, 36, 40, 44, 48]
                    },
                    "157": {
                        "内文P数": [4, 8, 12, 16, 20, 24, 28, 32, 36, 40, 44, 48]
                    },
                    "200": {
                        "内文P数": [4, 8, 12, 16, 20, 24, 28, 32, 36, 40]
                    },
                    "250": {
                        "内文P数": [4, 8, 12, 16, 20, 24, 28, 32]
                    },
                    "300": {
                        "内文P数": [4, 8, 12, 16, 20, 24, 28, 32]
                    }
                }
            },
            "无线胶装": {
                "内文P数": [48, 52, 56, 60, 64, 68, 72, 76, 80, 84, 88, 92, 96]
            }
        }
    };
	var albumConfig2 = {
		"页数(含封面)": {}
	};
	for(var i=8; i<=120; i+=4){
		if(i<40){
			albumConfig2["页数(含封面)"][i] = ["封面300g荷兰白内文157g铜版纸", "封面300g蛋壳纸内文157g铜版纸", "无线胶装"];
		}else{
			albumConfig2["页数(含封面)"][i] = ["封面内文157g铜版纸", "封面300g铜版纸覆哑膜内文200g铜版纸", "封面300g荷兰白内文200g铜版纸", "封面300g蛋壳纸内文200g铜版纸", "骑马钉"];
		}
	}debugger
var foldConfig = {
		"材质": {
			"157g铜版纸": ["双面覆膜", "压线"],
			"200g铜版纸": ["双面覆膜", "压线"],
			"250g铜版纸": ["不覆膜", "不压线"],
			"300g铜版纸": ["不覆膜", "不压线"]
		}
	};
    return {
        83: {
            paramDisable: { //互斥属性
                "打流水号": {
                    "不打流水号": ["红色流水号", "黑色流水号"]
                }
            }
        },
        101: {
            mutexCfg: albumConfig
        },
        102: {
            mutexCfg: albumConfig
        },
        103: {
            mutexCfg: albumConfig
        },
        104: {
            mutexCfg: albumConfig
        },
        200309: {
            namesOrder: ["材质类型", "成品规格", "数量"],
            paramDisable: { //关联禁用属性
                "成品规格": {
                    "7安（200ml）": ["1000", "2000"],
                    "12安（330ml）": ["1000", "2000"]
                }
            }
        },
        200476: {
            paramDisable: {
                "页数(含封面)": {
                    8: ["无线胶装", "250g铜版纸单面覆哑膜"],
                    12: ["无线胶装", "250g铜版纸单面覆哑膜"],
                    20: ["无线胶装", "250g铜版纸单面覆哑膜"],
                    28: ["无线胶装", "250g铜版纸单面覆哑膜"],
                    36: ["无线胶装", "250g铜版纸单面覆哑膜"],
                    44: ["无线胶装", "250g铜版纸单面覆哑膜"],
                    52: ["骑马钉", "250g铜版纸双面覆哑膜"],
                    60: ["骑马钉", "250g铜版纸双面覆哑膜"],
                    68: ["骑马钉", "250g铜版纸双面覆哑膜"],
                    76: ["骑马钉", "250g铜版纸双面覆哑膜"],
                    84: ["骑马钉", "250g铜版纸双面覆哑膜"],
                    92: ["骑马钉", "250g铜版纸双面覆哑膜"],
                    100: ["骑马钉", "250g铜版纸双面覆哑膜"],
                    108: ["骑马钉", "250g铜版纸双面覆哑膜"]
                }
            }
        },
        200478: {
            paramDisable: foldConfig
        },
        200479: {
            paramDisable: foldConfig
        },
        200480: {
            paramDisable: foldConfig
        },
        200483: {
            paramDisable: foldConfig
        },
        200484: {
            paramDisable: foldConfig
        },
        200485: {
            paramDisable: foldConfig
        },
        200481: {
            paramDisable: albumConfig2
        },
        200486: {
            paramDisable: albumConfig2
        },
        200517: {
            paramDisable: {
                "材质类型": {
                    "300g铜版纸": ["不覆膜"],
					"300g法国丽芙超感滑面超白": ["双面哑膜"]
                }
            }
        },
        200518: {
            paramDisable: {
                "材质类型": {
                    "300g铜版纸": ["不覆膜"],
					"300g法国丽芙超感滑面超白": ["单面哑膜"]
                }
            }
        },
        200519: {
            paramDisable: {
                "材质类型": {
                    "300g铜版纸": ["不覆膜"],
					"特种纸": ["单面哑膜"]
                }
            }
        },
		200549: {
			mutexCfg: {
                "内文材质": {
                    "157g铜版纸 骑马钉": {
						"内文P数": [8, 12, 16, 20, 24, 28, 32, 36, 40]
					},
                    "157g铜版纸 无线胶装": {
						"内文P数": [32, 40, 48, 56, 64, 72, 80, 88, 96, 104, 112]
					},
                    "200g铜版纸 骑马钉": {
						"内文P数": [8, 12, 16, 20, 24, 28, 32]
					},
                    "200g铜版纸 无线胶装": {
						"内文P数": [32, 40, 48, 56, 64, 72, 80]
					}
                }
            }
		},
        200572: {
			mutexCfg: {
                "产品款式": {
                    "团扇": {
						"成品尺寸": ["24cm*34cm"],
						"扇柄颜色": ["白色"],
						"扇面形状": ["标准型"]
					},
					"铆钉短柄扇": {
						"成品尺寸": ["17cm*18cm"],
						"扇柄颜色": ["蓝色", "红色", "白色"],
						"扇面形状": ["标准型", "自定义"]
					},
					"铆钉长柄扇": {
						"成品尺寸": ["17cm*18cm"],
						"扇柄颜色": ["蓝色", "红色", "白色"],
						"扇面形状": ["标准型", "自定义"]
					},
					"中柄扇": {
						"成品尺寸": ["17cm*18cm"],
						"扇柄颜色": ["蓝色", "红色", "白色"],
						"扇面形状": ["标准型", "自定义"]
					},
					"O型扇": {
						"成品尺寸": ["17cm*18cm"],
						"扇柄颜色": ["蓝色", "红色", "白色"],
						"扇面形状": ["标准型", "自定义"]
					},
					"筷子柄扇": {
						"成品尺寸": ["17cm*18cm"],
						"扇柄颜色": ["蓝色", "红色", "白色"],
						"扇面形状": ["标准型", "自定义"]
					}
                }
            }
            /*paramDisable: {
                "产品款式": {
                    "团扇": ["17cm*18cm", "蓝色", "红色", "自定义"],
					"铆钉短柄扇": ["24cm*34cm"],
					"铆钉长柄扇": ["24cm*34cm"],
					"中柄扇": ["24cm*34cm"],
					"O型扇": ["24cm*34cm"],
					"筷子柄扇": ["24cm*34cm"]
                }
            }*/
        }
    };
});