define("product/config/sqm", ["base", "tools"], function($, T){
    "use strict";
    //自定义产品属性配置
    return {
        200: {
            customMade: 1, //定制模式
            params: "",
            paramTips: { //属性提示
                "成品尺寸": "长度不足1米时按1米计算价格"
            },
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长度需要≥宽度！"
            },
            baseInfoName: "材质类型_数量_成品尺寸-布料颜色_丝印颜色_打孔工艺_白绳_车线",
            attrs: {//属性值
                "材质类型": ["横幅"],
                "数量": ["1"],
                "成品尺寸": ["0.6m*1m"],
                "布料颜色": ["红色", "白色", "蓝色", "绿色"],
                "丝印颜色": ["黄色", "白色"],
                "打孔工艺": ["不打孔", "打孔"],
                "白绳": ["不加白绳"],
                "车线": ["两边车线"]
            }
        },
        200034: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200035: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200036: {
            paramTips: { //属性提示
                "成品尺寸": "长边范围0.1~10m，短边范围0.1~5m；超过1.8m*1.2m，必须接受拼接"
            },
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200037: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200041: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200104: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200105: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200106: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200274: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200302: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200376: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200438: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200439: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200440: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200454: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200455: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200456: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200457: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200458: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200459: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200460: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200461: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200462: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200463: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200464: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200465: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200466: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200467: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200468: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200469: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        },
        200470: {
            paramDesc: { //属性描述
                "成品尺寸": "注：自定义长边需要≥短边！"
            }
        }
    };
});