INININ_CONFIG_CALLBACK({
    result: '0'
    ,data: {
        result:'0'
        ,callback: function(){
            //印刷产品分类
            CFG_DB.CATEGORY = [//'30,29,36,31,33,28,34'
                {id:30, name:'名片'}
                ,{id:29, name:'宣传用品'}
                ,{id:36, name:'画册'}
                ,{id:33, name:'营销卡券'}
                ,{id:28, name:'办公用品'}
            ];
            //左侧菜单及首页分类
            CFG_DB.PCFG = {
                //HOME: '1,2,28,29,33,36'
                //VNAV: '1,2,28,29,33,36'
                HOME:'30,29,36,33,28,35'//'30,29,36,31,33,28,34,35'
                ,VNAV:'30,29,36,33,28,35'//'30,29,36,31,33,28,34,35'
                ,TYPE: '30,29,36,33,28,35'//'30,29,36,31,33,28,34'
                ,NOT_WEIGHT: '_98_101_102_103_104_'
                ,NOT_DELIVERY_DAY: '_98_'
            };
            //推荐产品
            CFG_DB.CYBER = {//1:新,2:省,3:荐,4:优
                '124':1,'125':1,'126':1,'127':1,'128':1,'130':1,'131':1,
                '50':2,'54':2,'101':2,'102':2,'103':2,'104':2,
                '61':3,'64':3,'65':3,'66':3,'98':3,'111':3,'121':3,'113':3,
                '60':4
            };
            CFG_DB.MARKS = {//1:热销,2:出货快,3:推荐,4:实惠,5:新品
                '61':[1],'54':[1],'57':[1],
                '50':[2],'55':[2],
                '60':[3],'64':[3],'66':[3],
                '108':[4],'109':[4],'113':[4],
                '104':[5],'111':[5],'122':[5],'124':[5],'125':[5],'126':[5],'127':[5],'128':[5],'130':[5],'131':[5]
            };
            //账户充值
            CFG_DB.PACKAGE = {
                MARKS: {//1:热销,2:出货快,3:推荐,4:实惠,5:新品
                    '2':[1],
                    '6':[4]
                }
            };
            //设计服务
            CFG_DB.DESIGN = {
                ATTACH: '11'
                ,MODIFY: '12'
                ,LOGO: '11'
                ,ZHEYE: '25'
                ,MINGPIAN: '9'
            };
            //广告管理
            CFG_DB.ADVERT = {
                NOTICE: '9'//头部通知
                ,BANNER: '8'//首页大banner
                ,CYBER1: '10'//首页大banner下侧推荐产品1
                ,CYBER2: '11'//首页大banner下侧推荐产品2
                ,CYBER3: '12'//首页大banner下侧推荐产品3
                ,ADVERT: '13'//首页中部广告
            };
        }
    }
});