INININ_MEDIA_CALLBACK({
    result: '0',
    data: {
        result:'0',
        media:[
            {
                "logo": "/resources/media/111.jpg",
                "source": "科印网",
                "link": "http://www.keyin.cn/news/sczc/201605/18-1094832.shtml",
                "title": "云印发力“全方位数据化的企业定制服务平台”",
                "summary": "云印一直致力于打造国内最大的商务印刷设计服务平台，以互联网的方式连接客户和工厂，消去中间环节，为客户带来质优价廉的印刷设计服务。经过一年多的市场验证，云印的企业服务平台形象已深入人心，并获得了印刷领域专业人士和社会大众的认同",
                "date": "2016/5/18"
            },
            {
                "logo": "/resources/media/106.png",
                "source": "今日头条",
                "link": "http://toutiao.com/i6262929399608246785/",
                "title": "云印张军：我们最大的对手是自己",
                "summary": "随着互联网+的概念和模式不断地在很多传统行业落地验证，看起来百花齐放的景象下，也充满了荆棘和困难。作为互联网商业印刷行业领跑者的云印技术(ininin.com)公司创始人及CEO张军，分享了云印发展阶段的一些总结",
                "date": "2016/3/17"
            },
            {
                "logo": "/resources/media/110.jpg",
                "source": "环球网科技",
                "link": "http://tech.huanqiu.com/business/2015-07/7078500.html",
                "title": "云印，用互联网改变传统印刷行业",
                "summary": "2015年7月22日，最大互联网印刷设计服务平台——云印，在北京中关村举行主题为：“新”名片 “心”服务的新产品发布会，发布会上正式推出”新“名片系列产品和服务，这是云印用互联网改变传统印刷行业的又一个新举措",
                "date": "2015/7/23"
            },
            {
                "logo": "/resources/media/107.jpg",
                "source": "创业家",
                "link": "http://mp.weixin.qq.com/s?__biz=MTA3NDM1MzUwMQ==&mid=209282131&idx=3&sn=52845b5f872943162f33b42b3d6adc22&scene=5#rd",
                "title": "华为前高管拿5000万融资做名片，那里有怎样的诱惑丨黑马动态",
                "summary": "创业仅一年便顺利拿下5000万人民币A轮融资，在印刷O2O行业这只是开始。拥有着华为前高管背景的云印CEO张军，始终还是坚持不干大事，从小切口进入大市场；坚持不赚小钱，攒足劲憋大招",
                "date": "2015/7/23"
            },
            {
                "logo": "/resources/media/109.jpg",
                "source": "新浪",
                "link": "http://news.sina.com.cn/o/2015-07-23/141532139720.shtml",
                "title": "云印推新名片系列产品 名片+时代浮现",
                "summary": "2015年7月22日，最大互联网印刷设计服务平台——云印，在北京中关村举行主题为：“新”名片 “心”服务的新产品发布会，发布会上正式推出”新“名片系列产品和服务，这是云印用互联网改变传统印刷行业的又一个新举措",
                "date": "2015/7/23"
            },
            {
                "logo": "/resources/media/106.jpg",
                "source": "亿欧网",
                "link": "http://www.iyiou.com/p/19305?from=timeline&isappinstalled=0",
                "title": "云印推新名片系列产品 名片+时代浮现",
                "summary": "7月22日，亿欧网受邀参加印刷O2O平台云印技术新产品及融资消息发布会。会上，云印技术创始人张军对外宣布获得A轮5000万元融资。在此之前，云印技术曾于2013年11月就曾获得过旦恩创投等联合投资的1000万元天使轮融资",
                "date": "2015/7/22"
            },
            {
                "logo": "/resources/media/100.png",
                "source": "36氪",
                "link": "http://www.36kr.com/p/218531.html",
                "title": "还有哪个万亿传统市场正在被互联网改造？云印想做商务印刷领域的\"途牛\"",
                "summary": "互联网对传统行业发起的进攻无疑已经开始，云印选择以互联网的方式重构传统印刷行业。顾名思义，云印采用的是\"云印刷\"这种基于现代通讯、计算机、印刷技术、物流体系建立起来的远程网络印刷服务",
                "date": "2015/1/12"
            },
            {
                "logo": "/resources/media/101.png",
                "source": "科印网",
                "link": "http://www.keyin.cn/news/sczc/201412/02-1081019.shtml",
                "title": "云印技术：传统与IT融合的创业路",
                "summary": "张军所建立的云印技术（深圳）有限公司去年正式成立，不久便引起印刷业界的广泛关注。张军为什么会义无反顾地进入印刷业？IT背景团队的加入将对印刷业输入怎样的活力？带着种种好奇，我们采访了张军，听他讲述云印技术，这个印刷\"新兵\"并不寻常的创业故事",
                "date": "2014/12/2"
            },
            {
                "logo": "/resources/media/102.png",
                "source": "猎云网",
                "link": "http://www.lieyunwang.com/archives/69722",
                "title":"云印：工业4.0时代重度垂直商业印刷O2O，专注万亿印刷市场",
                "summary":"云印通过自主研发的互联网平台，管理线上、线下的入口流量，并和ERP系统对接，管理和运营印刷服务，使得印刷服务从原来的纯个性化定制向标准化，体系化，高效化发展，以期为用户带来的更优质的服务和更具信价比的产品，同时也让合作工厂能够有效的提升生产水平",
                "date": "2015/1/13"
            },
            {
                "logo": "/resources/media/103.png",
                "source": "亿欧网",
                "link": "http://www.iyiou.com/p/12961",
                "title": "云印技术CEO张军：专注印刷O2O的万亿市场！",
                "summary": "国内印刷业有万亿市场体量，但因为市场价格竞争导致一直被低端化，批量生产、竞争大、利润低，资本市场不重视。传统印刷业面临洗牌，云印技术用外行的打法，内行的经验，专注印刷O2O",
                "date": "2014/8/21"
            },
            {
                "logo": "/resources/media/104.png",
                "source": "品途网",
                "link": "http://www.pintu360.com/53845.html",
                "title": "云印：正在用互联网改造万亿级传统市场",
                "summary": "印刷行业 O2O 领域市场还处于待培育的阶段，市场足够大，需要多家一同参与将这块蛋糕做大，把生态圈营造出来",
                "date": "2015/1/13"
            },
            {
                "logo": "/resources/media/105.png",
                "source": "i黑马",
                "link": "http://news.iheima.com/show-9-113816-1.html",
                "title": "云印技术创始人张军：在不确定的路上奔跑",
                "summary": "张军，华为公司前任高管，他创立的云印技术是用互联网思维去改造传统的印刷包装行业，\"面对创业中的焦虑，我自己认准的方法是，在不确定的路上奔跑，用最快的速度去学习和尝试\"",
                "date": "2014/7/5"
            },
            {
                "logo": "/resources/media/103.png",
                "source": "亿欧网",
                "link": "http://www.iyiou.com/p/13526",
                "title": "亿欧盘点：深圳地区十大O2O类公司！",
                "summary": "近年来，深圳的互联网大环境逐步改善，深圳O2O的企业也不断涌现。亿欧网就此盘点深圳地区十大O2O企业与大家分享，他们分别是：房多多、里外网、猫屋、淘淘谷、土巴兔、云印技术、排队网、彩生活、顺丰嘿客、华阳信通",
                "date": "2014/9/23"
            },
            {
                "logo": "/resources/media/104.png",
                "source": "品途网",
                "link": "http://www.pintu360.com/37255.html",
                "title": "云印技术创始人张军：我是这样看待O2O",
                "summary": "Online To Offline，线下是传统业务，to可以是线上到线下、也是线下到线上，更是线上和线下的融合；所以O2O说的是互联网和传统行业的结合，毫无疑问，这是未来十年最大的发展趋势",
                "date": "2014/7/6"
            }
        ]
    }
});